#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Armor_Mocular_Core_Legs_Hosen_3

#include "Basic.hpp"

#include "Str_Medieval_Color_Swatches_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Armor_Mocular_Core_Legs_Hosen_3.BP_Armor_Mocular_Core_Legs_Hosen_3_C.UserConstructionScript
// 0x0168 (0x0168 - 0x0000)
struct BP_Armor_Mocular_Core_Legs_Hosen_3_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_2;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Medieval_Color_Swatches           K2Node_Select_Default;                             // 0x0010(0x0028)(HasGetValueTypeHash)
	struct FStr_Medieval_Color_Swatches           K2Node_Select_Default_1;                           // 0x0038(0x0028)(HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array;                            // 0x0060(0x0010)(ReferenceParm)
	struct FStr_Medieval_Color_Swatches           K2Node_MakeStruct_Str_Medieval_Color_Swatches;     // 0x0070(0x0028)(HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_2;                          // 0x00A8(0x0010)(ReferenceParm)
	struct FStr_Medieval_Color_Swatches           K2Node_MakeStruct_Str_Medieval_Color_Swatches_1;   // 0x00B8(0x0028)(HasGetValueTypeHash)
	struct FStr_Medieval_Color_Swatches           K2Node_MakeStruct_Str_Medieval_Color_Swatches_2;   // 0x00E0(0x0028)(HasGetValueTypeHash)
	TArray<struct FLinearColor>                   K2Node_MakeArray_Array_3;                          // 0x0108(0x0010)(ReferenceParm)
	struct FStr_Medieval_Color_Swatches           K2Node_MakeStruct_Str_Medieval_Color_Swatches_3;   // 0x0118(0x0028)(HasGetValueTypeHash)
	struct FStr_Medieval_Color_Swatches           K2Node_Select_Default_2;                           // 0x0140(0x0028)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_Armor_Mocular_Core_Legs_Hosen_3_C_UserConstructionScript;

}

