#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CombatEvent_Master

#include "Basic.hpp"

#include "Enum_CombatEvent_LoseConditions_structs.hpp"
#include "Enum_CombatEvent_Modes_structs.hpp"
#include "Str_Passport_CombatEvent1_structs.hpp"
#include "Enum_Ranks_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CombatEvent_Master.BP_CombatEvent_Master_C
// 0x0180 (0x0410 - 0x0290)
class ABP_CombatEvent_Master_C : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_;                                             // 0x0298(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Name_Prefix;                                       // 0x02A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             Thumbnail;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                  Level;                                             // 0x02C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TMap<Enum_CombatEvent_LoseConditions, bool>   Available_Lose_Conditions;                         // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<Enum_CombatEvent_Modes, bool>            Available_Combat_Modes;                            // 0x0338(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NPC_Equipment_Budget_Range;                        // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Combatants_Amount;                                 // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Reward;                                            // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount_of_Rounds;                                  // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CombatEvent_LoseConditions               Lose_Condition;                                    // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CombatEvent_Modes                        Combat_Mode;                                       // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x2];                                      // 0x039A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NPC_Equipment_Budget__Final_;                      // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Bet;                                               // 0x03A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Passport_CombatEvent1             Passport;                                          // 0x03A8(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	Enum_Ranks                                    Tier;                                              // 0x03F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F1[0x7];                                      // 0x03F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<Enum_Ranks>                            Available_Tiers;                                   // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CombatEvent_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CombatEvent_Master_C")
	}
	static class ABP_CombatEvent_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CombatEvent_Master_C>();
	}
};
DUMPER7_ASSERTS_ABP_CombatEvent_Master_C;

}

