#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generator_Weapons_Random

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_MaterialLayer_structs.hpp"
#include "Enum_WeaponType_structs.hpp"
#include "Enum_Ranks_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generator_Weapons_Random.BP_Generator_Weapons_Random_C
// 0x0020 (0x02B0 - 0x0290)
class ABP_Generator_Weapons_Random_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 Customizable_Modules;                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Custom_Material_Steel;                             // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Custom_Material_Colored_Metal;                     // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Custom_Material_Colored_Wood;                      // 0x02AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            Custom_Material_Colored_Leather;                   // 0x02AB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Add_Weapon_Module_to_Array(class UClass* Weapon_Module, Enum_Ranks Tier_In, double* Module_Price, Enum_Ranks* Tier_Out);
	void ExecuteUbergraph_BP_Generator_Weapons_Random(int32 EntryPoint);
	void Generate_Weapon(Enum_WeaponType Weapon_Type_Enum, Enum_Ranks Tier, bool Spawn_Specific_Weapon, class UClass* Specific_Class, const struct FStr_Passport_Weapon1& Specific_Passport, struct FStr_Passport_Weapon1* Weapon_Passport);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Generator_Weapons_Random_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Generator_Weapons_Random_C")
	}
	static class ABP_Generator_Weapons_Random_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generator_Weapons_Random_C>();
	}
};
DUMPER7_ASSERTS_ABP_Generator_Weapons_Random_C;

}

