#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_Ranks_structs.hpp"
#include "ArmorSlots_Enum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GameManager.BP_GameManager_C
// 0x0028 (0x02B8 - 0x0290)
class ABP_GameManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_HalfSwordGameMode_C*                As_BP_Half_Sword_Game_Mode;                        // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Tourney_Spawned_Today;                             // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Nemesis_Combat_Event_Spawned;                      // 0x02B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Create_Pre_Made_Weapon(const struct FStr_Passport_Weapon1& Str_Passport_Weapon, struct FStr_Passport_Weapon1* Weapon_Passport);
	void ExecuteUbergraph_BP_GameManager(int32 EntryPoint);
	void Generate_Combat_Events();
	void Generate_Random_Characters(int32 Amount_of_Characters_to_Spawn, double Equipment_Budget, bool Champion, Enum_Ranks Tier);
	void Generate_Random_Combat_Event(int32 Amount);
	void Generate_Random_Equipment();
	void Rearrange_Combat_Events();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_GameManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_GameManager_C")
	}
	static class ABP_GameManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GameManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_GameManager_C;

}

