#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Generator_Characters_Random

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_WeaponType_structs.hpp"
#include "Str_Medieval_Color_Swatches_structs.hpp"
#include "Enum_Ranks_structs.hpp"
#include "Enum_Nationalities_structs.hpp"
#include "Enum_Sides_RightLeft_structs.hpp"
#include "ArmorSlots_Enum_structs.hpp"
#include "SheathSlots_Enum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Generator_Characters_Random.BP_Generator_Characters_Random_C
// 0x0058 (0x02E8 - 0x0290)
class ABP_Generator_Characters_Random_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDA_Character_Names_Master_C*           Name_Generator;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStr_Medieval_Color_Swatches           Colors;                                            // 0x02A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Equipment_Budget;                                  // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Champion;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Generator_Characters_Random(int32 EntryPoint);
	void Generate_Character(class UClass* Actor_Class, Enum_Nationalities Nationality, Enum_Ranks Tier, bool Is_Mercenary, struct FStr_Passport_Character1* Character_Passport);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Generator_Characters_Random_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Generator_Characters_Random_C")
	}
	static class ABP_Generator_Characters_Random_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Generator_Characters_Random_C>();
	}
};
DUMPER7_ASSERTS_ABP_Generator_Characters_Random_C;

}

