#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeshBloodSim

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeshBloodSim.BP_MeshBloodSim_C
// 0x0060 (0x02F0 - 0x0290)
class ABP_MeshBloodSim_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0290(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector4>                       ParticleBaseData;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible)
	TArray<struct FVector>                        ParticleVelocities;                                // 0x02B0(0x0010)(Edit, BlueprintVisible)
	class UNiagaraComponent*                      BloodBlitRef;                                      // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 MainRenderTarget;                                  // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MaterialOfTheMesh;                                 // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MeshToSimOn;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        RemainingSimulationTime;                           // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSimulationTime;                                 // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MeshBloodSim(int32 EntryPoint);
	void Initialize(class UStaticMeshComponent* MeshSimulatedOn, double SlowFlowSpeed, double FastFlowSpeed, double MaxSimeTime, double DryoutSpeed, double IntensityMultiplier);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MeshBloodSim_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MeshBloodSim_C")
	}
	static class ABP_MeshBloodSim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeshBloodSim_C>();
	}
};
DUMPER7_ASSERTS_ABP_MeshBloodSim_C;

}

