#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeshBloodSimManager

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeshBloodSimManager.BP_MeshBloodSimManager_C
// 0x00E8 (0x0378 - 0x0290)
class ABP_MeshBloodSimManager_C final : public AActor
{
public:
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMeshComponent*, class ABP_MeshBloodSim_C*> SimulatedObjectsMap;                // 0x0298(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	class UClass*                                 BloodSimRef;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        SlowFlowSpeed;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FastFlowSpeed;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DryoutSpeed;                                       // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MaxSimTime;                                        // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        IntensityMultiplier;                               // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UStaticMeshComponent*, class ACSBloodSimActor*> SimulatedActors;                      // 0x0318(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	double                                        VelocityDecrement;                                 // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACSBloodSimActor*                       BloodSimActor;                                     // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)

public:
	void DoMeshBloodSim(class UStaticMeshComponent* MeshToSimOn, const struct FVector4& ParticleData, const struct FVector& ParticleVelocity);
	void UpdateSimulations(class UStaticMeshComponent* MeshToSimOn, const struct FVector4& LocationAndSize, const struct FVector& Velocity);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_MeshBloodSimManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_MeshBloodSimManager_C")
	}
	static class ABP_MeshBloodSimManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MeshBloodSimManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_MeshBloodSimManager_C;

}

