#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Weapon_Ranged_Projectle_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ModularWeaponBP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Weapon_Ranged_Projectle_Master.BP_Weapon_Ranged_Projectle_Master_C
// 0x0028 (0x0BE0 - 0x0BB8)
class ABP_Weapon_Ranged_Projectle_Master_C : public AModularWeaponBP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_Weapon_Ranged_Projectle_Master_C; // 0x0BB8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Base1_0;                                           // 0x0BC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x0BD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Weapon_Ranged_Projectle_Master(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Weapon_Ranged_Projectle_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Weapon_Ranged_Projectle_Master_C")
	}
	static class ABP_Weapon_Ranged_Projectle_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Weapon_Ranged_Projectle_Master_C>();
	}
};
DUMPER7_ASSERTS_ABP_Weapon_Ranged_Projectle_Master_C;

}

