#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChaosClothAssetEngine

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChaosClothAssetEngine.ChaosClothComponent.SetClothAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothComponent_SetClothAsset final
{
public:
	class UChaosClothAsset*                       InClothAsset;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothComponent_SetClothAsset;

// Function ChaosClothAssetEngine.ChaosClothComponent.SetEnableSimulation
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_SetEnableSimulation final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothComponent_SetEnableSimulation;

// Function ChaosClothAssetEngine.ChaosClothComponent.GetClothAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothComponent_GetClothAsset final
{
public:
	class UChaosClothAsset*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothComponent_GetClothAsset;

// Function ChaosClothAssetEngine.ChaosClothComponent.IsSimulationEnabled
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_IsSimulationEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothComponent_IsSimulationEnabled;

// Function ChaosClothAssetEngine.ChaosClothComponent.IsSimulationSuspended
// 0x0001 (0x0001 - 0x0000)
struct ChaosClothComponent_IsSimulationSuspended final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothComponent_IsSimulationSuspended;

// Function ChaosClothAssetEngine.ChaosClothAsset.GetShadowPhysicsAsset
// 0x0008 (0x0008 - 0x0000)
struct ChaosClothAsset_GetShadowPhysicsAsset final
{
public:
	class UPhysicsAsset*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ChaosClothAsset_GetShadowPhysicsAsset;

}

