#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CollisionDisabler

#include "Basic.hpp"

#include "CollisionDisabler_structs.hpp"


namespace SDK::Params
{

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.CancelModifyCollision
// 0x0020 (0x0020 - 0x0000)
struct CollisionDisablerFunctionLibrary_CancelModifyCollision final
{
public:
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_CancelModifyCollision;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.DisableCollision
// 0x0028 (0x0028 - 0x0000)
struct CollisionDisablerFunctionLibrary_DisableCollision final
{
public:
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToExpiration;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_DisableCollision;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.DisableCollision_SingleBodyVsSingleBody
// 0x0018 (0x0018 - 0x0000)
struct CollisionDisablerFunctionLibrary_DisableCollision_SingleBodyVsSingleBody final
{
public:
	class UPrimitiveComponent*                    SingleBodyA;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SingleBodyB;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToExpiration;                                  // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_DisableCollision_SingleBodyVsSingleBody;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.DisableCollision_SkeletalVsSingleBody
// 0x0028 (0x0028 - 0x0000)
struct CollisionDisablerFunctionLibrary_DisableCollision_SkeletalVsSingleBody final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBones;                                 // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SingleBody;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeToExpiration;                                  // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_DisableCollision_SkeletalVsSingleBody;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.DisableCollision_SkeletalVsSkeletal
// 0x0038 (0x0038 - 0x0000)
struct CollisionDisablerFunctionLibrary_DisableCollision_SkeletalVsSkeletal final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshA;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBonesA;                                // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshB;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBonesB;                                // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         TimeToExpiration;                                  // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_DisableCollision_SkeletalVsSkeletal;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.EnableCollision
// 0x0020 (0x0020 - 0x0000)
struct CollisionDisablerFunctionLibrary_EnableCollision final
{
public:
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_EnableCollision;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.EnableCollision_SingleBodyVsSingleBody
// 0x0010 (0x0010 - 0x0000)
struct CollisionDisablerFunctionLibrary_EnableCollision_SingleBodyVsSingleBody final
{
public:
	class UPrimitiveComponent*                    SingleBodyA;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SingleBodyB;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_EnableCollision_SingleBodyVsSingleBody;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.EnableCollision_SkeletalVsSingleBody
// 0x0020 (0x0020 - 0x0000)
struct CollisionDisablerFunctionLibrary_EnableCollision_SkeletalVsSingleBody final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBones;                                 // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    SingleBody;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_EnableCollision_SkeletalVsSingleBody;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.EnableCollision_SkeletalVsSkeletal
// 0x0030 (0x0030 - 0x0000)
struct CollisionDisablerFunctionLibrary_EnableCollision_SkeletalVsSkeletal final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshA;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBonesA;                                // 0x0008(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMeshB;                                     // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           SkeletalMeshBonesB;                                // 0x0020(0x0010)(ConstParm, Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_EnableCollision_SkeletalVsSkeletal;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.GatherAllPhysicalBones
// 0x0018 (0x0018 - 0x0000)
struct CollisionDisablerFunctionLibrary_GatherAllPhysicalBones final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           OutBones;                                          // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_GatherAllPhysicalBones;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.GatherAllPhysicalBonesFrom
// 0x0028 (0x0028 - 0x0000)
struct CollisionDisablerFunctionLibrary_GatherAllPhysicalBonesFrom final
{
public:
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   StartBone;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncudeStartBone;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           OutBones;                                          // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_GatherAllPhysicalBonesFrom;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.GatherAllPhysicalComponents
// 0x0018 (0x0018 - 0x0000)
struct CollisionDisablerFunctionLibrary_GatherAllPhysicalComponents final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            OutComponents;                                     // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_GatherAllPhysicalComponents;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.IsCollisionDisabled
// 0x0028 (0x0028 - 0x0000)
struct CollisionDisablerFunctionLibrary_IsCollisionDisabled final
{
public:
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_IsCollisionDisabled;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.IsCollisionModified
// 0x0028 (0x0028 - 0x0000)
struct CollisionDisablerFunctionLibrary_IsCollisionModified final
{
public:
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_IsCollisionModified;

// Function CollisionDisabler.CollisionDisablerFunctionLibrary.ModifyCollision
// 0x0038 (0x0038 - 0x0000)
struct CollisionDisablerFunctionLibrary_ModifyCollision final
{
public:
	struct FCollisionParams                       Params_0;                                          // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentA;                                        // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    ComponentB;                                        // 0x0020(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameA;                                         // 0x0028(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneNameB;                                         // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CollisionDisablerFunctionLibrary_ModifyCollision;

}

