#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_Tavern_Character_Master

#include "Basic.hpp"

#include "Enum_DayTime_structs.hpp"


namespace SDK::Params
{

// Function DA_Tavern_Character_Master.DA_Tavern_Character_Master_C.Get Spawn Chance
// 0x0020 (0x0020 - 0x0000)
struct DA_Tavern_Character_Master_C_Get_Spawn_Chance final
{
public:
	Enum_DayTime                                  Time;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Chance;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Map_Find_Value;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DA_Tavern_Character_Master_C_Get_Spawn_Chance;

}

