#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DiscordRpc

#include "Basic.hpp"

#include "DiscordRpc_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class DiscordRpc.DiscordRpc
// 0x0128 (0x0150 - 0x0028)
class UDiscordRpc final : public UObject
{
public:
	bool                                          IsConnected;                                       // 0x0028(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(const struct FDiscordUserData& joinRequest)> OnConnected;          // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ErrorCode, const class FString& errorMessage)> OnDisconnected; // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(int32 ErrorCode, const class FString& errorMessage)> OnErrored;    // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& joinSecret)> OnJoin;                          // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& spectateSecret)> OnSpectate;                  // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FDiscordUserData& joinRequest)> OnJoinRequest;        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FDiscordRichPresence                   RichPresence;                                      // 0x0090(0x00C0)(BlueprintVisible, NativeAccessSpecifierPublic)

public:
	void ClearPresence();
	void Initialize(const class FString& ApplicationId, bool autoRegister, const class FString& optionalSteamId);
	void Respond(const class FString& UserId, int32 Reply);
	void RunCallbacks();
	void Shutdown();
	void UpdatePresence();

	int64 GetStartTimeStamp() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DiscordRpc")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DiscordRpc")
	}
	static class UDiscordRpc* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDiscordRpc>();
	}
};
DUMPER7_ASSERTS_UDiscordRpc;

}

