#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EngineUserSettings

#include "Basic.hpp"

#include "EngineUserSettings_structs.hpp"


namespace SDK::Params
{

// Function EngineUserSettings.EngineUserSettingsBPLibrary.GetCurrentFeatureLevel
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_GetCurrentFeatureLevel final
{
public:
	EShaderFormat                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_GetCurrentFeatureLevel;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.GetCurrentRHI
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_GetCurrentRHI final
{
public:
	EGraphicsRHI                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_GetCurrentRHI;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.GetMaxFeatureLevel
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_GetMaxFeatureLevel final
{
public:
	EShaderFormat                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_GetMaxFeatureLevel;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.GetPreferredFeatureLevel
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_GetPreferredFeatureLevel final
{
public:
	EShaderFormat                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_GetPreferredFeatureLevel;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.GetPreferredRHI
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_GetPreferredRHI final
{
public:
	EGraphicsRHI                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_GetPreferredRHI;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.SetGameUserSettingsIniValue
// 0x0030 (0x0030 - 0x0000)
struct EngineUserSettingsBPLibrary_SetGameUserSettingsIniValue final
{
public:
	class FString                                 Section;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_SetGameUserSettingsIniValue;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.SetPreferredFeatureLevel
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_SetPreferredFeatureLevel final
{
public:
	EShaderFormat                                 ShaderFormat;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_SetPreferredFeatureLevel;

// Function EngineUserSettings.EngineUserSettingsBPLibrary.SetPreferredRHI
// 0x0001 (0x0001 - 0x0000)
struct EngineUserSettingsBPLibrary_SetPreferredRHI final
{
public:
	EGraphicsRHI                                  GraphicsRHI;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EngineUserSettingsBPLibrary_SetPreferredRHI;

}

