#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Gauntlet_Progress_Struct

#include "Basic.hpp"

#include "Str_Loadout_Equipment_structs.hpp"


namespace SDK
{

// UserDefinedStruct Gauntlet_Progress_Struct.Gauntlet_Progress_Struct
// 0x4DA0 (0x4DA0 - 0x0000)
struct FGauntlet_Progress_Struct final
{
public:
	struct FStr_Loadout_Equipment                 EquipmentRank1_2_67F453B5475B5E5EB85EBBAFBC737097; // 0x0000(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank2_4_6AA6C830413F696BA71CCF82F8DF229B; // 0x08A0(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank3_6_2D67B7F342DCEB1C44BFA9925890F582; // 0x1140(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank4_8_FC3715B54F6CE976F0BDB9BCEB54C1F2; // 0x19E0(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank5_10_24C0AF304C5F6E0ACC35748C97B9152C; // 0x2280(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank6_12_343172214215C531E3CDF997EEE427CE; // 0x2B20(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank7_19_C58DAA6E494D6DC174A9B4A0F0783C84; // 0x33C0(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank8_20_70E3D46A45F575F8C9DCDDAFCDB880B9; // 0x3C60(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 EquipmentRank9_21_827C646A425A87C8F004BE92C6163E6A; // 0x4500(0x08A0)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FGauntlet_Progress_Struct;

}

