#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HSComputeShaders

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class HSComputeShaders.CSBloodSimActor
// 0x00A0 (0x0330 - 0x0290)
class ACSBloodSimActor final : public AActor
{
public:
	class UTextureRenderTarget2D*                 DebugBloodRT;                                      // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             NormalMap;                                         // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             HeightMap;                                         // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             BloodSplatters;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 CurrentWrite;                                      // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 CurrentRead;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*               BoundMeshMatInstance;                              // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstanceDynamic*>       BoundMeshMatInstances;                             // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   BoundMesh;                                         // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RTSize;                                            // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityDecrement;                                 // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SlowFlowSpeed;                                     // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FastFlowSpeed;                                     // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DryoutSpeed;                                       // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxSimTime;                                        // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntensityMultiplier;                               // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector4f>                      LocationsAndSizes;                                 // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Velocities;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_320[0x10];                                     // 0x0320(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddNewParticle(const struct FVector4f& LocationAndSize, const struct FVector& Velocity);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CSBloodSimActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CSBloodSimActor")
	}
	static class ACSBloodSimActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACSBloodSimActor>();
	}
};
DUMPER7_ASSERTS_ACSBloodSimActor;

// Class HSComputeShaders.HSBloodCS_AsyncExecution
// 0x0000 (0x0030 - 0x0030)
class UHSBloodCS_AsyncExecution final : public UBlueprintAsyncActionBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HSBloodCS_AsyncExecution")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HSBloodCS_AsyncExecution")
	}
	static class UHSBloodCS_AsyncExecution* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHSBloodCS_AsyncExecution>();
	}
};
DUMPER7_ASSERTS_UHSBloodCS_AsyncExecution;

// Class HSComputeShaders.HSWoundsCS_AsyncExecution
// 0x0010 (0x0040 - 0x0030)
class UHSWoundsCS_AsyncExecution final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HSWoundsCS_AsyncExecution")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HSWoundsCS_AsyncExecution")
	}
	static class UHSWoundsCS_AsyncExecution* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHSWoundsCS_AsyncExecution>();
	}
};
DUMPER7_ASSERTS_UHSWoundsCS_AsyncExecution;

// Class HSComputeShaders.HSWoundsController
// 0x0020 (0x02B0 - 0x0290)
class AHSWoundsController final : public AActor
{
public:
	class UTexture2D*                             SplashTexture;                                     // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4f                              PositionRotation;                                  // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HSWoundsController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HSWoundsController")
	}
	static class AHSWoundsController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHSWoundsController>();
	}
};
DUMPER7_ASSERTS_AHSWoundsController;

}

