#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFramework

#include "Basic.hpp"

#include "MLDeformerFramework_structs.hpp"
#include "ComputeFramework_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "OptimusCore_classes.hpp"


namespace SDK
{

// Class MLDeformerFramework.MLDeformerAsset
// 0x0008 (0x0030 - 0x0028)
class UMLDeformerAsset final : public UObject
{
public:
	class UMLDeformerModel*                       Model;                                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerAsset")
	}
	static class UMLDeformerAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerAsset>();
	}
};
DUMPER7_ASSERTS_UMLDeformerAsset;

// Class MLDeformerFramework.MLDeformerVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerVizSettings : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerVizSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerVizSettings")
	}
	static class UMLDeformerVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerVizSettings>();
	}
};
DUMPER7_ASSERTS_UMLDeformerVizSettings;

// Class MLDeformerFramework.MLDeformerGeomCacheVizSettings
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGeomCacheVizSettings : public UMLDeformerVizSettings
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerGeomCacheVizSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerGeomCacheVizSettings")
	}
	static class UMLDeformerGeomCacheVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheVizSettings>();
	}
};
DUMPER7_ASSERTS_UMLDeformerGeomCacheVizSettings;

// Class MLDeformerFramework.MLDeformerMorphModelVizSettings
// 0x0010 (0x0038 - 0x0028)
class UMLDeformerMorphModelVizSettings final : public UMLDeformerGeomCacheVizSettings
{
public:
	float                                         MorphTargetDeltaThreshold;                         // 0x0028(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         MorphTargetNumber;                                 // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bDrawMorphTargets;                                 // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerMorphModelVizSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerMorphModelVizSettings")
	}
	static class UMLDeformerMorphModelVizSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelVizSettings>();
	}
};
DUMPER7_ASSERTS_UMLDeformerMorphModelVizSettings;

// Class MLDeformerFramework.MLDeformerComponent
// 0x0040 (0x00E0 - 0x00A0)
class UMLDeformerComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x28];                                      // 0x00A0(0x0028)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x00C8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	float                                         Weight;                                            // 0x00D0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         QualityLevel;                                      // 0x00D4(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMLDeformerModelInstance*               ModelInstance;                                     // 0x00D8(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)

public:
	void SetDeformerAsset(class UMLDeformerAsset* InDeformerAsset);
	void SetQualityLevel(int32 InQualityLevel);
	void SetWeight(float NormalizedWeightValue);
	void UpdateSkeletalMeshComponent();

	class USkeletalMeshComponent* FindSkeletalMeshComponent(const class UMLDeformerAsset* Asset) const;
	class UMLDeformerAsset* GetDeformerAsset() const;
	class UMLDeformerModelInstance* GetModelInstance() const;
	int32 GetQualityLevel() const;
	class USkeletalMeshComponent* GetSkeletalMeshComponent() const;
	float GetWeight() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerComponent")
	}
	static class UMLDeformerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponent>();
	}
};
DUMPER7_ASSERTS_UMLDeformerComponent;

// Class MLDeformerFramework.MLDeformerComponentSource
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerComponentSource final : public UOptimusComponentSource
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerComponentSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerComponentSource")
	}
	static class UMLDeformerComponentSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerComponentSource>();
	}
};
DUMPER7_ASSERTS_UMLDeformerComponentSource;

// Class MLDeformerFramework.MLDeformerModel
// 0x00C8 (0x00F0 - 0x0028)
class UMLDeformerModel : public UObject
{
public:
	uint8                                         Pad_28[0x98];                                      // 0x0028(0x0098)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NumBaseMeshVerts;                                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         NumTargetMeshVerts;                                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         MaxNumLODs;                                        // 0x00C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerInputInfo*                   InputInfo;                                         // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)
	TArray<int32>                                 VertexMap;                                         // 0x00D8(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class USkeletalMesh*                          SkeletalMesh;                                      // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerModel")
	}
	static class UMLDeformerModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModel>();
	}
};
DUMPER7_ASSERTS_UMLDeformerModel;

// Class MLDeformerFramework.MLDeformerGeomCacheModel
// 0x0000 (0x00F0 - 0x00F0)
class UMLDeformerGeomCacheModel : public UMLDeformerModel
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerGeomCacheModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerGeomCacheModel")
	}
	static class UMLDeformerGeomCacheModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGeomCacheModel>();
	}
};
DUMPER7_ASSERTS_UMLDeformerGeomCacheModel;

// Class MLDeformerFramework.MLDeformerGraphDebugDataInterface
// 0x0000 (0x0028 - 0x0028)
class UMLDeformerGraphDebugDataInterface final : public UOptimusComputeDataInterface
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerGraphDebugDataInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerGraphDebugDataInterface")
	}
	static class UMLDeformerGraphDebugDataInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataInterface>();
	}
};
DUMPER7_ASSERTS_UMLDeformerGraphDebugDataInterface;

// Class MLDeformerFramework.MLDeformerGraphDebugDataProvider
// 0x0010 (0x0038 - 0x0028)
class UMLDeformerGraphDebugDataProvider final : public UComputeDataProvider
{
public:
	class UMLDeformerComponent*                   DeformerComponent;                                 // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	class UMLDeformerAsset*                       DeformerAsset;                                     // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerGraphDebugDataProvider")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerGraphDebugDataProvider")
	}
	static class UMLDeformerGraphDebugDataProvider* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerGraphDebugDataProvider>();
	}
};
DUMPER7_ASSERTS_UMLDeformerGraphDebugDataProvider;

// Class MLDeformerFramework.MLDeformerInputInfo
// 0x0048 (0x0070 - 0x0028)
class UMLDeformerInputInfo : public UObject
{
public:
	struct FSoftObjectPath                        SkeletalMesh;                                      // 0x0028(0x0020)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                           BoneNames;                                         // 0x0048(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           CurveNames;                                        // 0x0058(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         NumBaseMeshVertices;                               // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, AssetRegistrySearchable, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         NumTargetMeshVertices;                             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerInputInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerInputInfo")
	}
	static class UMLDeformerInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerInputInfo>();
	}
};
DUMPER7_ASSERTS_UMLDeformerInputInfo;

// Class MLDeformerFramework.MLDeformerModelInstance
// 0x0060 (0x0088 - 0x0028)
class UMLDeformerModelInstance : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UMLDeformerModel*                       Model;                                             // 0x0030(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_38[0x50];                                      // 0x0038(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerModelInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerModelInstance")
	}
	static class UMLDeformerModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerModelInstance>();
	}
};
DUMPER7_ASSERTS_UMLDeformerModelInstance;

// Class MLDeformerFramework.MLDeformerMorphModel
// 0x00B8 (0x01A8 - 0x00F0)
class UMLDeformerMorphModel final : public UMLDeformerGeomCacheModel
{
public:
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bClampMorphWeights;                                // 0x0110(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector3f>                      MorphTargetDeltas;                                 // 0x0118(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                         NumMorphTargets;                                   // 0x0128(0x0004)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	uint64                                        CompressedMorphDataSizeInBytes;                    // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint64                                        UncompressedMorphDataSizeInBytes;                  // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<int32>                                 MorphTargetErrorOrder;                             // 0x0140(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 MorphTargetErrors;                                 // 0x0150(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<float>                                 MaxMorphWeights;                                   // 0x0160(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	TArray<struct FFloatInterval>                 MorphTargetsMinMaxWeights;                         // 0x0170(0x0010)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FMLDeformerMorphModelQualityLevel> QualityLevels;                                  // 0x0180(0x0010)(ZeroConstructor, Deprecated, NativeAccessSpecifierPrivate)
	bool                                          bIncludeNormals;                                   // 0x0190(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_191[0x3];                                      // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MorphDeltaZeroThreshold;                           // 0x0194(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         MorphCompressionLevel;                             // 0x0198(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EMLDeformerMaskChannel                        MaskChannel;                                       // 0x019C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bInvertMaskChannel;                                // 0x019D(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_19E[0xA];                                      // 0x019E(0x000A)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetMorphTargetDeltaFloats(const TArray<float>& Deltas);
	void SetMorphTargetDeltas(const TArray<struct FVector3f>& Deltas);
	void SetMorphTargetsErrorOrder(const TArray<int32>& MorphTargetOrder, const TArray<float>& ErrorValues);
	void SetMorphTargetsMaxWeights(const TArray<float>& MaxWeights);
	void SetMorphTargetsMinMaxWeights(const TArray<float>& MinValues, const TArray<float>& MaxValues);

	bool CanDynamicallyUpdateMorphTargets() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerMorphModel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerMorphModel")
	}
	static class UMLDeformerMorphModel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModel>();
	}
};
DUMPER7_ASSERTS_UMLDeformerMorphModel;

// Class MLDeformerFramework.MLDeformerMorphModelInputInfo
// 0x0000 (0x0070 - 0x0070)
class UMLDeformerMorphModelInputInfo final : public UMLDeformerInputInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerMorphModelInputInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerMorphModelInputInfo")
	}
	static class UMLDeformerMorphModelInputInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelInputInfo>();
	}
};
DUMPER7_ASSERTS_UMLDeformerMorphModelInputInfo;

// Class MLDeformerFramework.MLDeformerMorphModelInstance
// 0x0008 (0x0090 - 0x0088)
class UMLDeformerMorphModelInstance final : public UMLDeformerModelInstance
{
public:
	uint8                                         Pad_88[0x8];                                       // 0x0088(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MLDeformerMorphModelInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MLDeformerMorphModelInstance")
	}
	static class UMLDeformerMorphModelInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMLDeformerMorphModelInstance>();
	}
};
DUMPER7_ASSERTS_UMLDeformerMorphModelInstance;

}

