#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MLDeformerFramework

#include "Basic.hpp"


namespace SDK
{

// Enum MLDeformerFramework.EMLDeformerVizMode
// NumValues: 0x0003
enum class EMLDeformerVizMode : uint8
{
	TrainingData                             = 0,
	TestData                                 = 1,
	EMLDeformerVizMode_MAX                   = 2,
};

// Enum MLDeformerFramework.EMLDeformerHeatMapMode
// NumValues: 0x0003
enum class EMLDeformerHeatMapMode : uint8
{
	Activations                              = 0,
	GroundTruth                              = 1,
	EMLDeformerHeatMapMode_MAX               = 2,
};

// Enum MLDeformerFramework.EMLDeformerMaskChannel
// NumValues: 0x0006
enum class EMLDeformerMaskChannel : uint8
{
	Disabled                                 = 0,
	VertexColorRed                           = 1,
	VertexColorGreen                         = 2,
	VertexColorBlue                          = 3,
	VertexColorAlpha                         = 4,
	EMLDeformerMaskChannel_MAX               = 5,
};

// ScriptStruct MLDeformerFramework.MLDeformerCurveReference
// 0x0008 (0x0008 - 0x0000)
struct FMLDeformerCurveReference final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMLDeformerCurveReference;

// ScriptStruct MLDeformerFramework.MLDeformerTrainingInputAnim
// 0x0008 (0x0008 - 0x0000)
struct alignas(0x08) FMLDeformerTrainingInputAnim
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMLDeformerTrainingInputAnim;

// ScriptStruct MLDeformerFramework.MLDeformerGeomCacheTrainingInputAnim
// 0x0000 (0x0008 - 0x0008)
struct FMLDeformerGeomCacheTrainingInputAnim final : public FMLDeformerTrainingInputAnim
{
};
DUMPER7_ASSERTS_FMLDeformerGeomCacheTrainingInputAnim;

// ScriptStruct MLDeformerFramework.MLDeformerMorphModelQualityLevel
// 0x0004 (0x0004 - 0x0000)
struct FMLDeformerMorphModelQualityLevel final
{
public:
	int32                                         MaxActiveMorphs;                                   // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMLDeformerMorphModelQualityLevel;

// ScriptStruct MLDeformerFramework.MLDeformerCompareActor
// 0x0030 (0x0030 - 0x0000)
struct FMLDeformerCompareActor final
{
public:
	class FName                                   Name;                                              // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UMLDeformerAsset>        DeformerAsset;                                     // 0x0008(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMLDeformerCompareActor;

}

