#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_Sword_Blade_Master

#include "Basic.hpp"

#include "Enum_MaterialLayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Modular_Weapon_Module_classes.hpp"
#include "Enum_MaterialQuality_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Modular_Sword_Blade_Master.Modular_Sword_Blade_Master_C
// 0x0028 (0x0448 - 0x0420)
class AModular_Sword_Blade_Master_C : public AModular_Weapon_Module_C
{
public:
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Modular_Sword_Blade_Master_C;       // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         Length_SB;                                         // 0x0428(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mass_Rate_SB;                                      // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Point_SB;                                          // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Edge_SB;                                           // 0x0434(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Dism_Sharp;                                        // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Xx100;                                             // 0x043C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Yx100;                                             // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Modular_Sword_Blade_Master(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Modular_Sword_Blade_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Modular_Sword_Blade_Master_C")
	}
	static class AModular_Sword_Blade_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModular_Sword_Blade_Master_C>();
	}
};
DUMPER7_ASSERTS_AModular_Sword_Blade_Master_C;

}

