#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Modular_PA_Pommel_Master

#include "Basic.hpp"

#include "Modular_Weapon_Module_classes.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Modular_PA_Pommel_Master.Modular_PA_Pommel_Master_C
// 0x0010 (0x0430 - 0x0420)
class AModular_PA_Pommel_Master_C : public AModular_Weapon_Module_C
{
public:
	uint8                                         Pad_419[0x3];                                      // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Materian_Int_Min;                                  // 0x041C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Materian_Int_Max;                                  // 0x0420(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 Sub_Module;                                        // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Modular_PA_Pommel_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Modular_PA_Pommel_Master_C")
	}
	static class AModular_PA_Pommel_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AModular_PA_Pommel_Master_C>();
	}
};
DUMPER7_ASSERTS_AModular_PA_Pommel_Master_C;

}

