#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewBlueprint

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function NewBlueprint.NewBlueprint_C.ExecuteUbergraph_NewBlueprint
// 0x0060 (0x0060 - 0x0000)
struct NewBlueprint_C_ExecuteUbergraph_NewBlueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0008(0x0018)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Pause_Eng_C*                        CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0030(0x0018)(HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NewBlueprint_C_ExecuteUbergraph_NewBlueprint;

// Function NewBlueprint.NewBlueprint_C.InpActEvt_P_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct NewBlueprint_C_InpActEvt_P_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NewBlueprint_C_InpActEvt_P_K2Node_InputKeyEvent_0;

// Function NewBlueprint.NewBlueprint_C.InpActEvt_Pause_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct NewBlueprint_C_InpActEvt_Pause_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NewBlueprint_C_InpActEvt_Pause_K2Node_InputActionEvent_0;

// Function NewBlueprint.NewBlueprint_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct NewBlueprint_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NewBlueprint_C_ReceiveTick;

}

