#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RVPDPRapidJson

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeBool_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeBool_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeBool_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeBoolArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeBoolArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeBoolArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeColorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeColorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeColorArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFColor_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFColor_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFColor_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFloat_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFloat_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFloat_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeFloatArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeFloatArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeFloatArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFName_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFName_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFName_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFRotator_Wrapper
// 0x0028 (0x0028 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFRotator_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFRotator_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFString_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFString_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFString_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFText_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFText_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFText_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFTransform_Wrapper
// 0x0070 (0x0070 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFTransform_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0010(0x0060)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFTransform_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeFVector_Wrapper
// 0x0028 (0x0028 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeFVector_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeFVector_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeInt32ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeInt32ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeInt32ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeInt64_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeInt64_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int64                                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeInt64_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeInt64ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeInt64ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeInt64ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeInt_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeInt_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeInt_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeNameArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeNameArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeNameArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeRotatorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeRotatorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeRotatorArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeStringArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeStringArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeStringArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayBool_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayBool_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<bool>                                  ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayBool_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFColor_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFColor_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFColor_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFloat_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFloat_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFloat_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFName_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFName_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFName_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFRotator_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFRotator_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFRotator_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFString_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFString_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFString_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFText_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFText_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFText_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFTransform_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFTransform_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFTransform_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayFVector_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFVector_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayFVector_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayInt64_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayInt64_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int64>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayInt64_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayInt_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayInt_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayInt_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeTArrayUInt8_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeTArrayUInt8_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeTArrayUInt8_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeTextArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeTextArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FText>                           DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeTextArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeTransformArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeTransformArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeTransformArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeserializeUInt8_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeserializeUInt8_Wrapper final
{
public:
	class FString                                 JsonString;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeserializeUInt8_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeUInt8ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeUInt8ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeUInt8ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.DeSerializeVectorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_DeSerializeVectorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 StringToDeSerialize;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        DeSerializedResult;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_DeSerializeVectorArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeBool_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeBool_Wrapper final
{
public:
	bool                                          BoolValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeBool_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeBoolArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeBoolArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeBoolArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeColorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeColorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeColorArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFColor_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFColor_Wrapper final
{
public:
	struct FColor                                 ColorValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFColor_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFloat_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFloat_Wrapper final
{
public:
	float                                         FloatValue;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFloat_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFloatArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFloatArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<float>                                 ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFloatArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFName_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFName_Wrapper final
{
public:
	class FName                                   NameValue;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFName_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFRotator_Wrapper
// 0x0028 (0x0028 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFRotator_Wrapper final
{
public:
	struct FRotator                               RotatorValue;                                      // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFRotator_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFString_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFString_Wrapper final
{
public:
	class FString                                 StringValue;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFString_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFText_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFText_Wrapper final
{
public:
	class FText                                   TextValue;                                         // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFText_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFTransform_Wrapper
// 0x0070 (0x0070 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFTransform_Wrapper final
{
public:
	struct FTransform                             TransformValue;                                    // 0x0000(0x0060)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFTransform_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeFVector_Wrapper
// 0x0028 (0x0028 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeFVector_Wrapper final
{
public:
	struct FVector                                VectorValue;                                       // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeFVector_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeInt32ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeInt32ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeInt32ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeInt64_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeInt64_Wrapper final
{
public:
	int64                                         Int64Value;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeInt64_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeInt64ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeInt64ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeInt64ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeInt_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeInt_Wrapper final
{
public:
	int32                                         IntValue;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeInt_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeNameArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeNameArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeNameArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeRotatorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeRotatorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FRotator>                       ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeRotatorArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeStringArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeStringArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeStringArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayBool_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayBool_Wrapper final
{
public:
	TArray<bool>                                  InBools;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayBool_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFColor_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFColor_Wrapper final
{
public:
	TArray<struct FColor>                         Colors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFColor_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFloat_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFloat_Wrapper final
{
public:
	TArray<float>                                 inFloats;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFloat_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFName_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFName_Wrapper final
{
public:
	TArray<class FName>                           InNames;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFName_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFRotator_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFRotator_Wrapper final
{
public:
	TArray<struct FRotator>                       InRotator;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFRotator_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFString_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFString_Wrapper final
{
public:
	TArray<class FString>                         InStrings;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFString_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFText_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFText_Wrapper final
{
public:
	TArray<class FText>                           InTexts;                                           // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFText_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFTransform_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFTransform_Wrapper final
{
public:
	TArray<struct FTransform>                     InTransform;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFTransform_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayFVector_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayFVector_Wrapper final
{
public:
	TArray<struct FVector>                        inFVector;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayFVector_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayInt64_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayInt64_Wrapper final
{
public:
	TArray<int64>                                 InInt64s;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayInt64_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayInt_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayInt_Wrapper final
{
public:
	TArray<int32>                                 InInts;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayInt_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTArrayUInt8_Wrapper
// 0x0020 (0x0020 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTArrayUInt8_Wrapper final
{
public:
	TArray<uint8>                                 InUInt8s;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTArrayUInt8_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTextArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTextArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FText>                           ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTextArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeTransformArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeTransformArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeTransformArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeUInt8_Wrapper
// 0x0018 (0x0018 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeUInt8_Wrapper final
{
public:
	uint8                                         UInt8Value;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeUInt8_Wrapper;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeUint8ArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeUint8ArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeUint8ArrayAsync;

// Function RVPDPRapidJson.RVPDPRapidJsonFunctionLibrary.SerializeVectorArrayAsync
// 0x0040 (0x0040 - 0x0000)
struct RVPDPRapidJsonFunctionLibrary_SerializeVectorArrayAsync final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLatentActionInfo                      LatentInfo;                                        // 0x0008(0x0018)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        ArrayToSerialize;                                  // 0x0020(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 SerializedString;                                  // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RVPDPRapidJsonFunctionLibrary_SerializeVectorArrayAsync;

}

