#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_Equipment

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "Str_ArmorElements_structs.hpp"
#include "Str_Loadout_Equipment_structs.hpp"
#include "SG_ArmorSaveStruct_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_Equipment.SG_Equipment_C
// 0x08F0 (0x0918 - 0x0028)
class USG_Equipment_C final : public USaveGame
{
public:
	struct FStr_ArmorElements                     Armor_Colors;                                      // 0x0028(0x0038)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FStr_Loadout_Equipment                 Equipment_Struct;                                  // 0x0060(0x08A0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Rank;                                              // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Team;                                              // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSG_ArmorSaveStruct>            SavedArmor;                                        // 0x0908(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SG_Equipment_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SG_Equipment_C")
	}
	static class USG_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_Equipment_C>();
	}
};
DUMPER7_ASSERTS_USG_Equipment_C;

}

