#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_GameProgress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Enum_DayTime_structs.hpp"
#include "Str_Passport_Armor1_structs.hpp"
#include "Str_Passport_Character1_structs.hpp"
#include "Str_Passport_Weapon1_structs.hpp"
#include "Str_Inventory_structs.hpp"
#include "Enum_Ranks_structs.hpp"
#include "Str_Passport_CombatEvent1_structs.hpp"
#include "Str_Character_Body_Condition_structs.hpp"
#include "Enum_GameMode_structs.hpp"
#include "Enum_CombatEvent_LoseConditions_structs.hpp"
#include "Enum_CombatEvent_Modes_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass SG_GameProgress.SG_GameProgress_C
// 0x0878 (0x08A0 - 0x0028)
class USG_GameProgress_C final : public USaveGame
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	Enum_DayTime                                  Day_Time;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Day_Count;                                         // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Passport_Character1               Player_Character;                                  // 0x0038(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FStr_Inventory                         Player_Inventory;                                  // 0x0178(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FStr_Inventory                         Merchant_Inventory;                                // 0x0198(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         Player_Funds;                                      // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_Passport_Character1>       Available_Combatants;                              // 0x01C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStr_Passport_Weapon1>          Available_Weapons_1H;                              // 0x01D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStr_Passport_Weapon1>          Available_Weapons_2H;                              // 0x01E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStr_Passport_Weapon1>          Available_Shields;                                 // 0x01F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FStr_Passport_Armor1>           Available_Custom_Armor;                            // 0x0200(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          First_Start;                                       // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Innkeeper_Errand_Int;                              // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Player_Just_Died;                                  // 0x0218(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Free_Mode_Activated;                               // 0x0219(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21A[0x6];                                      // 0x021A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Passport_Character1               Free_Mode_Player_Character_1;                      // 0x0220(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FStr_Inventory                         Free_Mode_Player_Inventory;                        // 0x0360(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Fencer_Present;                                    // 0x0380(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Merchant_Present;                                  // 0x0381(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tailor_Present;                                    // 0x0382(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Armorsmith_Present;                                // 0x0383(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Weaponsmith_Present;                               // 0x0384(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Seer_Present;                                      // 0x0385(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Jester_Present;                                    // 0x0386(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Mercenaries_Present;                               // 0x0387(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Patrons_Present;                                   // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_Passport_CombatEvent1>     Available_Combat_Events;                           // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Inventory_Opening;                                 // 0x03A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Ranks                                    Current_Opponent_TIer_to_Spawn;                    // 0x03A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Ranks                                    Player_Tier;                                       // 0x03A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A3[0x5];                                      // 0x03A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Character_Body_Condition          Player_Body_Condition;                             // 0x03A8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Carried_Bolt_Count;                                // 0x03E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Tourney_Spawned_Today;                             // 0x03EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FStr_Passport_Character1>       Dead_Opponents;                                    // 0x03F0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStr_Inventory                         Insured_Items;                                     // 0x0400(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FStr_Inventory                         Hell_Items;                                        // 0x0420(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<int32, struct FStr_Passport_Character1>  Hired_Characters;                                  // 0x0440(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FStr_Passport_Character1>  Mercenaries_for_Hire;                              // 0x0490(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Assigned_Mercenaries;                              // 0x04E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, struct FStr_Character_Body_Condition> Mercenaries_Health;                            // 0x04F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, int32>                            Mercenaries_DayTimes;                              // 0x0540(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 Expired_Mercenaries;                               // 0x0590(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Reputation_on_Rank;                                // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Ranks                                    Permanent_Tier;                                    // 0x05A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A5[0x3];                                      // 0x05A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UWorld>                  Last_Open_Level;                                   // 0x05A8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	int32                                         Sparring_Partner_ID;                               // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Last_Open_Level_Path;                              // 0x05D4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rounds_To_WIn;                                     // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Rounds_Won;                                        // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Due_Reward;                                        // 0x05E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStr_Passport_Character1>       Spawned_Combatants;                                // 0x05E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	Enum_GameMode                                 Current_Game_Mode_Enum;                            // 0x05F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CombatEvent_LoseConditions               Current_Lose_Condition;                            // 0x05F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_CombatEvent_Modes                        Current_Combat_Mode;                               // 0x05FA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5FB[0x1];                                      // 0x05FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Combatants_Amount;                                 // 0x05FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_Passport_Character1               Player_Character_In_Hell;                          // 0x0600(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          Progression_Multiplayer;                           // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Passport_Character1               Free_Mode_Player_Character_2;                      // 0x0748(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FStr_Passport_Character1>       Nemesis_Opponents;                                 // 0x0888(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         Baron_Defeated_Times;                              // 0x0898(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          First_Start_Intro_Played;                          // 0x089C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          First_Start_Tutorial_Played;                       // 0x089D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          First_Start_Innkeeper_Greeted;                     // 0x089E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SG_GameProgress(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SG_GameProgress_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SG_GameProgress_C")
	}
	static class USG_GameProgress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USG_GameProgress_C>();
	}
};
DUMPER7_ASSERTS_USG_GameProgress_C;

}

