#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SG_PlayerProgression

#include "Basic.hpp"

#include "Str_Loadout_Equipment_structs.hpp"
#include "Gauntlet_Progress_Struct_structs.hpp"


namespace SDK::Params
{

// Function SG_PlayerProgression.SG_PlayerProgression_C.ExecuteUbergraph_SG_PlayerProgression
// 0x2C358 (0x2C358 - 0x0000)
struct SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct;        // 0x0008(0x4DA0)(HasGetValueTypeHash)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x4DA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DA9[0x7];                                     // 0x4DA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_1;      // 0x4DB0(0x4DA0)(HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x9B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9B51[0x7];                                     // 0x9B51(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FStr_Loadout_Equipment                 K2Node_CustomEvent_Saved_Equipment_Struct;         // 0x9B58(0x08A0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_2;      // 0xA3F8(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_3;      // 0xF198(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_4;      // 0x13F38(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_5;      // 0x18CD8(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_6;      // 0x1DA78(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_7;      // 0x22818(0x4DA0)(HasGetValueTypeHash)
	struct FGauntlet_Progress_Struct              K2Node_MakeStruct_Gauntlet_Progress_Struct_8;      // 0x275B8(0x4DA0)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SG_PlayerProgression_C_ExecuteUbergraph_SG_PlayerProgression;

// Function SG_PlayerProgression.SG_PlayerProgression_C.Save Rank Equipment Event
// 0x08A0 (0x08A0 - 0x0000)
struct SG_PlayerProgression_C_Save_Rank_Equipment_Event final
{
public:
	struct FStr_Loadout_Equipment                 Saved_Equipment_Struct;                            // 0x0000(0x08A0)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_SG_PlayerProgression_C_Save_Rank_Equipment_Event;

}

