#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_CurrentlyForgedWeapon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_CurrentlyForgedWeapon.Str_CurrentlyForgedWeapon
// 0x0088 (0x0088 - 0x0000)
struct FStr_CurrentlyForgedWeapon final
{
public:
	class UClass*                                 CustomizableModules_2_AB72AE81436F5DD49951E5823C431524; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHeadInt_5_3F9164824C8B1ECE6504D9ABAF562195; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHeadSub1Int_7_FED4F6AE440262D06B046CBE8346D833; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentHeadSub2Int_9_0158F2434C920BF5B7F9B49951AEDC6B; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGuardInt_11_C3F1D64D4EA863A29F0133A09146C0E8; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGripInt_13_34B4F88D446B216086C59A93C33B38AF; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentPommelInt_15_CC6A1BE94DC18511063996914C272614; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeadMassScale_18_1781F365442BEDEC256A11BC1FAF981A; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GuardMassScale_20_085D3D034A025B6647DD4586361C0324; // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GripMassScale_22_2DE2403341406AB9B328B089B7E3D1D9; // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PommelMassScale_24_5C44BE0A4C8FB6E2D3A5A6A9E4D4403B; // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HeadScale_26_99B1203B410228133236ACA65C448E01;     // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GuardScale_28_62CF8C814065AD4AD3017A8734F95272;    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GripScale_30_F98D25C84F13919AF62DC6AFAA480033;     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PommelScale_32_25F934A44ABA5731ED0B6BA7DB328ED6;   // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PickedColorLeather_35_13908E184DE7E4228C9C2B9CA88FD405; // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           PickedColorWood_37_EA86C88E47141159FE5355BB669696F2; // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            CustomMaterialColoredMetal_40_5D2F4E4947D637F1B82E82ACB54B9A54; // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_CurrentlyForgedWeapon;

}

