#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_Loadout_Weapons

#include "Basic.hpp"

#include "Str_WeaponParts_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_Loadout_Weapons.Str_Loadout_Weapons
// 0x0850 (0x0850 - 0x0000)
struct FStr_Loadout_Weapons final
{
public:
	struct FStr_WeaponParts                       WeaponHandR_2_64D3388F445655CA2E9E60B639016D17;    // 0x0000(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponHandL_4_4BF5616F480598D39F54058D5181EB86;    // 0x0130(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponSlotR1_6_140F311C4B659EE501761B8D99781B20;   // 0x0260(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponSlotR2_8_8B0CA70A4477398EB3B1E58EBB1AD2DC;   // 0x0390(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponSlotL1_10_908E8A984A1C041B0CC6238D804CEB60;  // 0x04C0(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponSlotL2_12_EF7AA9044E150C11545E349E5AD7C2E0;  // 0x05F0(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStr_WeaponParts                       WeaponBack_14_2CBE21CA47095EF150DD5791D72AC8C9;    // 0x0720(0x0130)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_Loadout_Weapons;

}

