#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_Passport_Weapon1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Enum_Ranks_structs.hpp"
#include "Enum_MaterialLayer_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_Passport_Weapon1.Str_Passport_Weapon1
// 0x0100 (0x0100 - 0x0000)
struct FStr_Passport_Weapon1 final
{
public:
	class UClass*                                 WeaponClass_54_B478ECF7499977809745A3973AD678EC;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ID_70_C02CF656483647A1933EEA96314B78A6;            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_57_3729B51148E846FE8DD336B9419BCEE1;          // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 HeadSubModule1_7_ABBFD017411F42A4950B1C9F2360A30D; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadSubModule2_9_90AAA8304C7794E1BF814C9354A1A7E9; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 HeadModule_11_62DF53134688807E1DA7F4A20E9F7139;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GuardModule_13_6DD2B06245505E53B529D090333012F0;   // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PommelModule_15_561B01324BFCD4360DAE9A95299BB9D6;  // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GripModule_18_F4DF51EB4E742195B8C6BAB17E4C5DB4;    // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HeadSize_21_2D425E61473B8F64FBAB51B223459D57;      // 0x0048(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GuardSize_23_5A1AA0E04708E86FEFF61E974DDA8704;     // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GripSize_25_AC1660814C4C25C521AAA8830FE8ECCF;      // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PommelSize_27_660CC00C49C26D503E16B2BC58CE115E;    // 0x0090(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CustomMassScaleHead_30_B95872A242AD944E2CE4D493F718F9D7; // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CustomMassScaleGuard_51_3A9024E74306B7BB5D186087011D1927; // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CustomMassScaleGrip_32_0EAADEE0419C05C6DB38F0AE134A9B10; // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CustomMassScalePommel_34_0AB28D814BDEF17D408D0DAA3A453173; // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            MaterialMetalSteel_37_AB7A28C94B176CF81A6C8BA34AC57C36; // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            MaterialMetalColored_39_DC2EAC244758A8D82855CC940784A1D2; // 0x00C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            MaterialWeood_41_E0B3C8DB48943B878AEFA3AB01E7B99A; // 0x00CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_MaterialLayer                            MaterialLeather_43_41D1114148FDB4FE4DACC8A2F4CA9FEB; // 0x00CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorWood_46_F3AE05AD4495EBCD1D354C8025D7C743;     // 0x00CC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ColorLeather_48_DC45F07E4C0C3280278212A7158EE638;  // 0x00DC(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Price_60_83FE5A624EA188485BBE4E9C8606AEE5;         // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_Ranks                                    Tier_67_05026E6F43B7300AA8BACC9D9F9AB461;          // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_Passport_Weapon1;

}

