#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_Passport_Character1

#include "Basic.hpp"

#include "Str_SubPassport_Equipment_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_Passport_Character1.Str_Passport_Character1
// 0x0140 (0x0140 - 0x0000)
struct FStr_Passport_Character1 final
{
public:
	class UClass*                                 ActorClass_14_E282C465414F6D4EF2A8039FBA847AD2;    // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         ID_30_34ACE6474D440109A9E2A7A6273471AD;            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Name_17_B6D81FDC43E42876968BADA7E392A1D3;          // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Height_21_0EB204DF4978B92AD0ED188FD32EEC7B;        // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Weight_23_65E4C6534D14653F96EB739F159E58CD;        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Skill_43_4CF5DCC248424BFADCCD6AB9F5F39CC9;         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStr_SubPassport_Equipment             Equipment_26_741A2FC641801842FE691295645C604F;     // 0x0030(0x00F0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                         FaceType_34_FB5E4D464B2A5CF6406C3CB19051FCE3;      // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EyeColor_46_826504294B0D51C1343D848E8B1AB4C6;      // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HairColor_38_CBDC51B043E6816A062799A9A96EB232;     // 0x0128(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        HairLength_41_9295B3CF41DF9BED0FEDB9AE02E7FC16;    // 0x0138(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_Passport_Character1;

}

