#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ColorPicker_Widget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ColorPicker_Widget.UI_ColorPicker_Widget_C
// 0x0040 (0x0320 - 0x02E0)
class UUI_ColorPicker_Widget_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USynth2DSlider*                         Synth2DSlider_201;                                 // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const struct FLinearColor& Color)> OnColorChanged;                 // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FLinearColor                           Picked_Color;                                      // 0x0300(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Current_Color_Picker_Value;                        // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_ColorPicker_Widget_Synth2DSlider_201_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEventSynth2D__DelegateSignature(float Value);
	void BndEvt__UI_ColorPicker_Widget_Synth2DSlider_201_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEventSynth2D__DelegateSignature(float Value);
	void BndEvt__UI_ColorPicker_Widget_Synth2DSlider_201_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEventSynth2D__DelegateSignature();
	void ExecuteUbergraph_UI_ColorPicker_Widget(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Set_New_Value_Event(const struct FVector2D& New_Value);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_ColorPicker_Widget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_ColorPicker_Widget_C")
	}
	static class UUI_ColorPicker_Widget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ColorPicker_Widget_C>();
	}
};
DUMPER7_ASSERTS_UUI_ColorPicker_Widget_C;

}

