#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Dialog_Widget_Fencer_FreeMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "Enum_Ranks_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Dialog_Widget_Fencer_FreeMode.UI_Dialog_Widget_Fencer_FreeMode_C
// 0x0028 (0x0308 - 0x02E0)
class UUI_Dialog_Widget_Fencer_FreeMode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_1;                                          // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGI_Settings_C*                         As_GI_Settings;                                    // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Dialog_Widget_Fencer_Progression_Button_K2Node_ComponentBoundEvent_11_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Dialog_Widget_Fencer_Progression_Button_K2Node_ComponentBoundEvent_9_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__UI_Dialog_Widget_Innkeeper_Button_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_Dialog_Widget_Innkeeper_Button_1_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature();
	void ExecuteUbergraph_UI_Dialog_Widget_Fencer_FreeMode(int32 EntryPoint);
	class FText GetText();
	ESlateVisibility GetVisibility_0();
	ESlateVisibility GetVisibility_1();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Dialog_Widget_Fencer_FreeMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Dialog_Widget_Fencer_FreeMode_C")
	}
	static class UUI_Dialog_Widget_Fencer_FreeMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Dialog_Widget_Fencer_FreeMode_C>();
	}
};
DUMPER7_ASSERTS_UUI_Dialog_Widget_Fencer_FreeMode_C;

}

