#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_KeyBinds

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_KeyBinds.UI_KeyBinds_C.ExecuteUbergraph_UI_KeyBinds
// 0x0110 (0x0110 - 0x0000)
struct UI_KeyBinds_C_ExecuteUbergraph_UI_KeyBinds final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UGI_Settings_C*                         K2Node_DynamicCast_AsGI_Settings;                  // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_AudioSettings_C*                    CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_GameSettings_C*                     CallFunc_Create_ReturnValue_2;                     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_DisplaySettings2_C*                 CallFunc_Create_ReturnValue_3;                     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Controls_C*                         CallFunc_Create_ReturnValue_4;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_7;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_8;              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_9;              // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0098(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_1;             // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue_2;             // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x5];                                       // 0x00FB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Create_ReturnValue_5;                     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_ExecuteUbergraph_UI_KeyBinds;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Arrow Time Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Arrow_Time_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Arrow_Time_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Crouch Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Crouch_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Crouch_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Give Up Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Give_Up_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Give_Up_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Inventory Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Inventory_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Inventory_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Left Hand Grab Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Left_Hand_Grab_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Left_Hand_Grab_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Left Hand Swing Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Left_Hand_Swing_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Left_Hand_Swing_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Lock On Target Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Lock_On_Target_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Lock_On_Target_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Photo Mode Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Photo_Mode_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Photo_Mode_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Right Hand Grab Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Right_Hand_Grab_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Right_Hand_Grab_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Right Hand Swing Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Right_Hand_Swing_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Right_Hand_Swing_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Run Key Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Run_Key_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Run_Key_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Sheathe Left Text
// 0x0060 (0x0060 - 0x0000)
struct UI_KeyBinds_C_Get_Sheathe_Left_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0020(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Sheathe_Left_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Sheathe Right Text
// 0x0060 (0x0060 - 0x0000)
struct UI_KeyBinds_C_Get_Sheathe_Right_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0020(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0050(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Sheathe_Right_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Swap Hands Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Swap_Hands_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Swap_Hands_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Switch View Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Switch_View_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Switch_View_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Text From Action Mapping
// 0x00D0 (0x00D0 - 0x0000)
struct UI_KeyBinds_C_Get_Text_From_Action_Mapping final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ReturnParm)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0068(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item;                           // 0x0080(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00AD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00AE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AF[0x1];                                       // 0x00AF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x00B0(0x0010)()
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Text_From_Action_Mapping;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Thrust Mode Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_Thrust_Mode_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Thrust_Mode_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get Thrust Text
// 0x0050 (0x0050 - 0x0000)
struct UI_KeyBinds_C_Get_Thrust_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_Thrust_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get_RunText_1_Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_RunText_1_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_RunText_1_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get_RunText_2_Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_RunText_2_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_RunText_2_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get_RunText_3_Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_RunText_3_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_RunText_3_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.Get_RunText_4_Text
// 0x0020 (0x0020 - 0x0000)
struct UI_KeyBinds_C_Get_RunText_4_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	class FText                                   CallFunc_Get_Text_From_Action_Mapping_ReturnValue; // 0x0010(0x0010)()
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Get_RunText_4_Text;

// Function UI_KeyBinds.UI_KeyBinds_C.OnKeyDown
// 0x0298 (0x0298 - 0x0000)
struct UI_KeyBinds_C_OnKeyDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FKeyEvent                              InKeyEvent;                                        // 0x0038(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FEventReply                            ReturnValue;                                       // 0x0078(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_GetKey_ReturnValue;                       // 0x0130(0x0018)(HasGetValueTypeHash)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0148(0x0010)()
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x0158(0x00B8)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0228(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0238(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0248(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0288(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_OnKeyDown;

// Function UI_KeyBinds.UI_KeyBinds_C.OnMouseButtonDown
// 0x0390 (0x0390 - 0x0000)
struct UI_KeyBinds_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00B0(0x00B8)(Parm, OutParm, ReturnParm)
	struct FKey                                   CallFunc_PointerEvent_GetEffectingButton_ReturnValue; // 0x0168(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0188(0x0010)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0198(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FEventReply                            CallFunc_Handled_ReturnValue;                      // 0x01A8(0x00B8)()
	struct FEventReply                            CallFunc_Handled_ReturnValue_1;                    // 0x0260(0x00B8)()
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0320(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0330(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0340(0x0028)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0368(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0380(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_OnMouseButtonDown;

// Function UI_KeyBinds.UI_KeyBinds_C.Start Rebind
// 0x0068 (0x0068 - 0x0000)
struct UI_KeyBinds_C_Start_Rebind final
{
public:
	class FName                                   ActionName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UButton*                                ActionButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ActionButtonText;                                  // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_MakeLiteralString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0050(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Start_Rebind;

// Function UI_KeyBinds.UI_KeyBinds_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_KeyBinds_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_KeyBinds_C_Tick;

}

