#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PhotoMode

#include "Basic.hpp"

#include "S_PhotoResolutions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "S_PostProcessFilter_structs.hpp"
#include "S_PhotosData_structs.hpp"
#include "S_PostProcessRendering_structs.hpp"
#include "S_Logos_structs.hpp"
#include "E_ColorGradingMode_structs.hpp"


namespace SDK::Params
{

// Function UI_PhotoMode.UI_PhotoMode_C.ActiveTab
// 0x0820 (0x0820 - 0x0000)
struct UI_PhotoMode_C_ActiveTab final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TabButton_C*                        ButtonToNotModify;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FButtonStyle                           NormalTabStyle;                                    // 0x0010(0x03F0)(Edit, BlueprintVisible)
	struct FButtonStyle                           ActiveTabStyle;                                    // 0x0400(0x03F0)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TabButton_C*                        CallFunc_Array_Get_Item;                           // 0x07F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0800(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0804(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_805[0x3];                                      // 0x0805(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0808(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x080C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_80D[0x3];                                      // 0x080D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_ActiveTab;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Aperture_K2Node_ComponentBoundEvent_33_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Autofocus_K2Node_ComponentBoundEvent_5_OnCheckboxValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__BlueCorrection_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Brightness_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__CameraDistance_K2Node_ComponentBoundEvent_6_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__CameraRoll_K2Node_ComponentBoundEvent_7_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__CharacterRotation_K2Node_ComponentBoundEvent_3_OnCheckboxValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ChromaticAberrationIntensity_K2Node_ComponentBoundEvent_10_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ChromaticAberrationOffset_K2Node_ComponentBoundEvent_11_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ColorBalanceBlue_K2Node_ComponentBoundEvent_15_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ColorBalanceGreen_K2Node_ComponentBoundEvent_16_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ColorBalanceIntensity_K2Node_ComponentBoundEvent_17_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ColorBalanceRed_K2Node_ComponentBoundEvent_18_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__ColorBalanceSelector_K2Node_ComponentBoundEvent_32_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FieldOfView_K2Node_ComponentBoundEvent_8_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FilmGrain_K2Node_ComponentBoundEvent_12_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Filter_K2Node_ComponentBoundEvent_31_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FocusDistance_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FrameBlue_K2Node_ComponentBoundEvent_19_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FrameGreen_K2Node_ComponentBoundEvent_20_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FrameRed_K2Node_ComponentBoundEvent_21_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FrameSelector_K2Node_ComponentBoundEvent_29_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__FrameSize_K2Node_ComponentBoundEvent_22_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Grid_K2Node_ComponentBoundEvent_6_OnCheckboxValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__HideCharacter_K2Node_ComponentBoundEvent_4_OnCheckboxValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LogoAngle_K2Node_ComponentBoundEvent_23_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LogoHorizontalAlignment_K2Node_ComponentBoundEvent_24_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LogoSelector_K2Node_ComponentBoundEvent_27_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LogoSize_K2Node_ComponentBoundEvent_25_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LogoVerticalAlignment_K2Node_ComponentBoundEvent_26_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__LUTIntensity_K2Node_ComponentBoundEvent_9_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__LUTIntensity_K2Node_ComponentBoundEvent_9_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__LUTIntensity_K2Node_ComponentBoundEvent_9_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__MotionBlur_K2Node_ComponentBoundEvent_13_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__MotionBlur_K2Node_ComponentBoundEvent_13_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__MotionBlur_K2Node_ComponentBoundEvent_13_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__PhotoResolution_K2Node_ComponentBoundEvent_28_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__PhotoResolution_K2Node_ComponentBoundEvent_28_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__PhotoResolution_K2Node_ComponentBoundEvent_28_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Rendering_K2Node_ComponentBoundEvent_30_OnOptionChanged__DelegateSignature
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Rendering_K2Node_ComponentBoundEvent_30_OnOptionChanged__DelegateSignature final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionText;                                        // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Rendering_K2Node_ComponentBoundEvent_30_OnOptionChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__SensorWidth_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__SensorWidth_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__SensorWidth_K2Node_ComponentBoundEvent_5_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Slider_SimplifiedContrast_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Slider_SimplifiedContrast_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Slider_SimplifiedContrast_K2Node_ComponentBoundEvent_1_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Slider_SimplifiedGamma_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Slider_SimplifiedGamma_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Slider_SimplifiedGamma_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Slider_SimplifiedSaturation_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Slider_SimplifiedSaturation_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Slider_SimplifiedSaturation_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Temperature_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Temperature_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Temperature_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Tint_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Tint_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Tint_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.BndEvt__Vignette_K2Node_ComponentBoundEvent_14_OnSliderValueChanged__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_PhotoMode_C_BndEvt__Vignette_K2Node_ComponentBoundEvent_14_OnSliderValueChanged__DelegateSignature final
{
public:
	double                                        SliderValue;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_BndEvt__Vignette_K2Node_ComponentBoundEvent_14_OnSliderValueChanged__DelegateSignature;

// Function UI_PhotoMode.UI_PhotoMode_C.CameraDistanceMouseWheel
// 0x0008 (0x0008 - 0x0000)
struct UI_PhotoMode_C_CameraDistanceMouseWheel final
{
public:
	double                                        Delta;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_CameraDistanceMouseWheel;

// Function UI_PhotoMode.UI_PhotoMode_C.CameraLeftRight
// 0x0008 (0x0008 - 0x0000)
struct UI_PhotoMode_C_CameraLeftRight final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_CameraLeftRight;

// Function UI_PhotoMode.UI_PhotoMode_C.CameraModeTxt
// 0x0048 (0x0048 - 0x0000)
struct UI_PhotoMode_C_CameraModeTxt final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0018(0x0010)()
	class FText                                   Temp_text_Variable_1;                              // 0x0028(0x0010)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0010)()
};
DUMPER7_ASSERTS_UI_PhotoMode_C_CameraModeTxt;

// Function UI_PhotoMode.UI_PhotoMode_C.CameraUpDown
// 0x0008 (0x0008 - 0x0000)
struct UI_PhotoMode_C_CameraUpDown final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_CameraUpDown;

// Function UI_PhotoMode.UI_PhotoMode_C.ChangeFreeCameraFOV
// 0x0008 (0x0008 - 0x0000)
struct UI_PhotoMode_C_ChangeFreeCameraFOV final
{
public:
	double                                        FOVValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_ChangeFreeCameraFOV;

// Function UI_PhotoMode.UI_PhotoMode_C.ChangeFreeCameraRotation
// 0x0018 (0x0018 - 0x0000)
struct UI_PhotoMode_C_ChangeFreeCameraRotation final
{
public:
	struct FRotator                               RotationValue;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_ChangeFreeCameraRotation;

// Function UI_PhotoMode.UI_PhotoMode_C.ChangeTab
// 0x0004 (0x0004 - 0x0000)
struct UI_PhotoMode_C_ChangeTab final
{
public:
	int32                                         TabIndex;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PhotoMode_C_ChangeTab;

// Function UI_PhotoMode.UI_PhotoMode_C.ExecuteUbergraph_UI_PhotoMode
// 0x37F0 (0x37F0 - 0x0000)
struct UI_PhotoMode_C_ExecuteUbergraph_UI_PhotoMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0020(0x0010)()
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0030(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array;                            // 0x0040(0x0010)(ReferenceParm)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x0058(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x0070(0x0010)(ReferenceParm)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_2;            // 0x0080(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_3;            // 0x0090(0x0010)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_4;            // 0x0100(0x0010)()
	TArray<class FString>                         CallFunc_Map_Keys_Keys_1;                          // 0x0110(0x0010)(ReferenceParm)
	struct FS_PhotoResolutions                    CallFunc_Array_Get_Item;                           // 0x0120(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x3];                                      // 0x0139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              K2Node_MakeStruct_IntPoint;                        // 0x013C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_5;            // 0x0148(0x0010)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_6;            // 0x0158(0x0010)()
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_175[0x3];                                      // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x01A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A2[0x2];                                      // 0x01A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FIntPoint                              CallFunc_Get_Default_Screen_Resolution_Resolution__X_and_Y_; // 0x01A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_3; // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_TabButton_C*                        CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x7];                                      // 0x01D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUI_TabButton_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x01E0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUI_Checkbox_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x01F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUI_Selector_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x0200(0x0010)(ReferenceParm, ContainsInstancedReference)
	TArray<class UUI_Slider_C*>                   CallFunc_GetAllWidgetsOfClass_FoundWidgets_3;      // 0x0210(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         Temp_int_Variable_1;                               // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               K2Node_CustomEvent_RotationValue;                  // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0244(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_CustomEvent_FOVValue;                       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush;                      // 0x0260(0x00D0)()
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_1;                    // 0x0330(0x00D0)()
	int32                                         Temp_int_Variable_2;                               // 0x0400(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_404[0xC];                                      // 0x0404(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_MakeStruct_SlateBrush_2;                    // 0x0410(0x00D0)()
	int32                                         K2Node_CustomEvent_Index;                          // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x04E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_TabIndex;                             // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_TabButton_C*                        K2Node_Event_CommonButtonPressed;                  // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x04F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x04FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FB[0x1];                                      // 0x04FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable_3;                               // 0x04FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_504[0x4];                                      // 0x0504(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_PhotoResolutions                    CallFunc_Array_Get_Item_2;                         // 0x0508(0x0018)(HasGetValueTypeHash)
	int32                                         Temp_int_Variable_4;                               // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_539[0x7];                                      // 0x0539(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCineCameraComponent*                   K2Node_DynamicCast_AsCine_Camera_Component;        // 0x0540(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0549(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
