#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Shop_TraderItemWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Shop_TraderItemWidget_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_BP_OnItemExpansionChanged;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct UI_Shop_TraderItemWidget_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_BP_OnItemSelectionChanged;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.Deselect
// 0x0010 (0x0010 - 0x0000)
struct UI_Shop_TraderItemWidget_C_Deselect final
{
public:
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_Deselect;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.ExecuteUbergraph_UI_Shop_TraderItemWidget
// 0x0008 (0x0008 - 0x0000)
struct UI_Shop_TraderItemWidget_C_ExecuteUbergraph_UI_Shop_TraderItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_ExecuteUbergraph_UI_Shop_TraderItemWidget;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.Get_Back_ColorAndOpacity
// 0x0040 (0x0040 - 0x0000)
struct UI_Shop_TraderItemWidget_C_Get_Back_ColorAndOpacity final
{
public:
	struct FLinearColor                           ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0010(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_1;                // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue_2;                // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_Get_Back_ColorAndOpacity;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.Get_ItemWeight_Text
// 0x0010 (0x0010 - 0x0000)
struct UI_Shop_TraderItemWidget_C_Get_ItemWeight_Text final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_Get_ItemWeight_Text;

// Function UI_Shop_TraderItemWidget.UI_Shop_TraderItemWidget_C.Get_ItemWeight_Visibility
// 0x0005 (0x0005 - 0x0000)
struct UI_Shop_TraderItemWidget_C_Get_ItemWeight_Visibility final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_Shop_TraderItemWidget_C_Get_ItemWeight_Visibility;

}

