#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: USDStage

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "USDClasses_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "UnrealUSDWrapper_structs.hpp"
#include "USDStage_structs.hpp"


namespace SDK
{

// Class USDStage.UsdDynamicBindingResolverLibrary
// 0x0000 (0x0028 - 0x0028)
class UUsdDynamicBindingResolverLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FMovieSceneDynamicBindingResolveResult ResolveWithStageActor(class UObject* WorldContextObject, const struct FMovieSceneDynamicBindingResolveParams& Params_0, const class FString& StageActorIDNameFilter, const class FString& RootLayerFilter, const class FString& PrimPath);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdDynamicBindingResolverLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdDynamicBindingResolverLibrary")
	}
	static class UUsdDynamicBindingResolverLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdDynamicBindingResolverLibrary>();
	}
};
DUMPER7_ASSERTS_UUsdDynamicBindingResolverLibrary;

// Class USDStage.UsdPrimTwin
// 0x0088 (0x00B0 - 0x0028)
class UUsdPrimTwin final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PrimPath;                                          // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class USceneComponent>         SceneComponent;                                    // 0x0050(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UUsdPrimTwin*>      Children;                                          // 0x0058(0x0050)(Transient, UObjectWrapper, NativeAccessSpecifierPrivate, TObjectPtr)
	TWeakObjectPtr<class UUsdPrimTwin>            Parent;                                            // 0x00A8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdPrimTwin")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdPrimTwin")
	}
	static class UUsdPrimTwin* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdPrimTwin>();
	}
};
DUMPER7_ASSERTS_UUsdPrimTwin;

// Class USDStage.UsdStageActor
// 0x0308 (0x0598 - 0x0290)
class AUsdStageActor final : public AActor
{
public:
	struct FFilePath                              RootLayer;                                         // 0x0290(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdStageState                                StageState;                                        // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUsdAssetCache2*                        UsdAssetCache;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic, TObjectPtr)
	EUsdInitialLoadSet                            InitialLoadSet;                                    // 0x02B0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdInterpolationType                         InterpolationType;                                 // 0x02B1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B2[0x2];                                      // 0x02B2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KindsToCollapse;                                   // 0x02B4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMergeIdenticalMaterialSlots;                      // 0x02B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReuseIdenticalAssets;                             // 0x02B9(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCollapseTopLevelPointInstancers;                  // 0x02BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BB[0x1];                                      // 0x02BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PurposesToLoad;                                    // 0x02BC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NaniteTriangleThreshold;                           // 0x02C0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RenderContext;                                     // 0x02C4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   MaterialPurpose;                                   // 0x02CC(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUsdRootMotionHandling                        RootMotionHandling;                                // 0x02D4(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D5[0x3];                                      // 0x02D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SubdivisionLevel;                                  // 0x02D8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUsdMetadataImportOptions              MetadataOptions;                                   // 0x02E0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	uint8                                         Pad_300[0xA8];                                     // 0x0300(0x00A8)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x03A8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	float                                         Time;                                              // 0x03B0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequence*                         LevelSequence;                                     // 0x03B8(0x0008)(Edit, ZeroConstructor, Transient, EditConst, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUsdPrimTwin*                           RootUsdTwin;                                       // 0x03C0(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	TSet<class FString>                           PrimsToAnimate;                                    // 0x03C8(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TMap<class UObject*, class FString>           ObjectsToWatch;                                    // 0x0418(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class UUsdAssetCache*                         AssetCache;                                        // 0x0468(0x0008)(ZeroConstructor, NoDestructor, AdvancedDisplay, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	class UUsdTransactor*                         Transactor;                                        // 0x0470(0x0008)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected, TObjectPtr)
	uint8                                         Pad_478[0x120];                                    // 0x0478(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	TArray<class UObject*> GetGeneratedAssets(const class FString& PrimPath);
	class USceneComponent* GetGeneratedComponent(const class FString& PrimPath);
	class ULevelSequence* GetLevelSequence();
	class FString GetSourcePrimPath(class UObject* Object);
	void NewStage();
	void SetAssetCache(class UUsdAssetCache2* NewCache);
	void SetBlockedPrefixFilters(const TArray<class FString>& NewFilters);
	void SetCollapseTopLevelPointInstancers(bool bCollapse);
	void SetCollectFromEntireSubtrees(bool bNewCollectValue);
	void SetCollectMetadata(bool bNewCollectValue);
	void SetCollectOnComponents(bool bNewCollectValue);
	void SetInitialLoadSet(EUsdInitialLoadSet NewLoadSet);
	void SetInterpolationType(EUsdInterpolationType NewType);
	void SetInvertFilters(bool bNewInvertValue);
	void SetIsolatedRootLayer(const class FString& IsolatedStageRootLayer);
	void SetKindsToCollapse(int32 NewKindsToCollapse);
	void SetMaterialPurpose(const class FName& NewMaterialPurpose);
	void SetMergeIdenticalMaterialSlots(bool bMerge);
	void SetNaniteTriangleThreshold(int32 NewNaniteTriangleThreshold);
	void SetPurposesToLoad(int32 NewPurposesToLoad);
	void SetRenderContext(const class FName& NewRenderContext);
	void SetReuseIdenticalAssets(bool bReuse);
	void SetRootLayer(const class FString& RootFilePath);
	void SetRootMotionHandling(EUsdRootMotionHandling NewHandlingStrategy);
	void SetStageState(EUsdStageState NewStageState);
	void SetSubdivisionLevel(int32 NewLevel);
	void SetTime(float InTime);

	class FString GetIsolatedRootLayer() const;
	float GetTime() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdStageActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdStageActor")
	}
	static class AUsdStageActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUsdStageActor>();
	}
};
DUMPER7_ASSERTS_AUsdStageActor;

// Class USDStage.UsdTransactor
// 0x0010 (0x0038 - 0x0028)
class UUsdTransactor final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UsdTransactor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UsdTransactor")
	}
	static class UUsdTransactor* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUsdTransactor>();
	}
};
DUMPER7_ASSERTS_UUsdTransactor;

}

