#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VertexPaintDetectionPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum VertexPaintDetectionPlugin.EPaintWithinAreaShape
// NumValues: 0x0004
enum class EPaintWithinAreaShape : uint8
{
	IsSquareOrRectangleShape                 = 0,
	IsSphereShape                            = 1,
	IsComplexShape                           = 2,
	EPaintWithinAreaShape_MAX                = 3,
};

// Enum VertexPaintDetectionPlugin.EVertexColorChannel
// NumValues: 0x0005
enum class EVertexColorChannel : uint8
{
	RedChannel                               = 0,
	GreenChannel                             = 1,
	BlueChannel                              = 2,
	AlphaChannel                             = 3,
	EVertexColorChannel_MAX                  = 4,
};

// Enum VertexPaintDetectionPlugin.ESurfaceAtChannel
// NumValues: 0x0006
enum class ESurfaceAtChannel : uint8
{
	Default                                  = 0,
	RedChannel                               = 1,
	GreenChannel                             = 2,
	BlueChannel                              = 3,
	AlphaChannel                             = 4,
	ESurfaceAtChannel_MAX                    = 5,
};

// Enum VertexPaintDetectionPlugin.FRVPDPPaintColorSnippetSetting
// NumValues: 0x0003
enum class EFRVPDPPaintColorSnippetSetting : uint8
{
	PaintSingleSnippet                       = 0,
	PaintGroupSnippet                        = 1,
	FRVPDPPaintColorSnippetSetting_MAX       = 2,
};

// Enum VertexPaintDetectionPlugin.EApplyVertexColorSetting
// NumValues: 0x0003
enum class EApplyVertexColorSetting : uint8
{
	EAddVertexColor                          = 0,
	ESetVertexColor                          = 1,
	EApplyVertexColorSetting_MAX             = 2,
};

// Enum VertexPaintDetectionPlugin.FRVPDPStartFallOffDistanceFromSetting
// NumValues: 0x0003
enum class EFRVPDPStartFallOffDistanceFromSetting : uint8
{
	BaseOfPaintShape                         = 0,
	EndOfPaintShape                          = 1,
	FRVPDPStartFallOffDistanceFromSetting_MAX = 2,
};

// Enum VertexPaintDetectionPlugin.EVertexPaintAtLocationFallOffType
// NumValues: 0x0004
enum class EVertexPaintAtLocationFallOffType : uint8
{
	OutwardFallOff                           = 0,
	InwardFallOff                            = 1,
	SphericalFallOff                         = 2,
	EVertexPaintAtLocationFallOffType_MAX    = 3,
};

// Enum VertexPaintDetectionPlugin.EPaintEntireMeshPropogateToLODsMethod
// NumValues: 0x0003
enum class EPaintEntireMeshPropogateToLODsMethod : uint8
{
	ModifiedEngineMethod                     = 0,
	DontPropogateLOD0ToAllLODs               = 1,
	EPaintEntireMeshPropogateToLODsMethod_MAX = 2,
};

// Enum VertexPaintDetectionPlugin.EVertexPaintWithinAreaFallOffType
// NumValues: 0x0004
enum class EVertexPaintWithinAreaFallOffType : uint8
{
	SphericalFromCenter                      = 0,
	GradiantUpward                           = 1,
	GradiantDownward                         = 2,
	EVertexPaintWithinAreaFallOffType_MAX    = 3,
};

// Enum VertexPaintDetectionPlugin.ELoadColorSnippetDataAssetOptions
// NumValues: 0x0003
enum class ELoadColorSnippetDataAssetOptions : uint8
{
	LoadPaintColorSnippetDataAsset           = 0,
	LoadCompareWithColorSnippetDataAsset     = 1,
	ELoadColorSnippetDataAssetOptions_MAX    = 2,
};

// Enum VertexPaintDetectionPlugin.ETVertexPaintThreadPriority
// NumValues: 0x0005
enum class ETVertexPaintThreadPriority : uint8
{
	TimeCritical                             = 0,
	Highest                                  = 1,
	Normal                                   = 2,
	Slowest                                  = 3,
	ETVertexPaintThreadPriority_MAX          = 4,
};

// ScriptStruct VertexPaintDetectionPlugin.RVPDPPhysicsSurfaceDataAtChannelInfo
// 0x0020 (0x0020 - 0x0000)
struct FRVPDPPhysicsSurfaceDataAtChannelInfo final
{
public:
	EPhysicalSurface                              PhysicalSurfaceAtChannel;                          // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 PhysicalSurfaceAsStringAtChannel;                  // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PhysicalSurfaceValueAtChannel;                     // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPPhysicsSurfaceDataAtChannelInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAdditionalDataToPassThroughInfo
// 0x0130 (0x0130 - 0x0000)
struct FRVPDPAdditionalDataToPassThroughInfo final
{
public:
	class AActor*                                 PassThrough_Actor1;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 PassThrough_Actor2;                                // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PassThrough_PrimitiveComponent1;                   // 0x0010(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    PassThrough_PrimitiveComponent2;                   // 0x0018(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool1;                                 // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool2;                                 // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PassThrough_Bool3;                                 // 0x0022(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PassThrough_Byte1;                                 // 0x0023(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         PassThrough_Byte2;                                 // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PassThrough_Float1;                                // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float2;                                // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float3;                                // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PassThrough_Float4;                                // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PassThrough_Int1;                                  // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PassThrough_Int2;                                  // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector1;                               // 0x0040(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector2;                               // 0x0058(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector3;                               // 0x0070(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                PassThrough_Vector4;                               // 0x0088(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               PassThrough_Rotator1;                              // 0x00A0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               PassThrough_Rotator2;                              // 0x00B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FString                                 PassThrough_String1;                               // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PassThrough_String2;                               // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PassThrough_Name1;                                 // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PassThrough_Name2;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              PassThrough_PhysicsSurface1;                       // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              PassThrough_PhysicsSurface2;                       // 0x0101(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      PassThrough_PhysicalMaterial1;                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             PassThrough_ObjectCollisionChannel;                // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EObjectTypeQuery                              PassThrough_ObjectType;                            // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          PassThrough_RandomStream;                          // 0x0114(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                PassThrough_UObject1;                              // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                PassThrough_UObject2;                              // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPAdditionalDataToPassThroughInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPMostDominantPhysicsSurfaceInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPMostDominantPhysicsSurfaceInfo final
{
public:
	EPhysicalSurface                              MostDominantPhysicsSurface;                        // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 MostDominantPhysicsSurfaceAsString;                // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MostDominantPhysicstSurfaceValue;                  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<ESurfaceAtChannel>                     MostDominantPhysicsSurfaceAtVertexColorChannels;   // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPMostDominantPhysicsSurfaceInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSerializedColorsPerLODInfo
// 0x0018 (0x0018 - 0x0000)
struct FRVPDPSerializedColorsPerLODInfo final
{
public:
	int32                                         Lod;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ColorsAtLODAsJSonString;                           // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPSerializedColorsPerLODInfo;

// ScriptStruct VertexPaintDetectionPlugin.VertexDetectMeshDataPerLODStruct
// 0x0060 (0x0060 - 0x0000)
struct FVertexDetectMeshDataPerLODStruct final
{
public:
	int32                                         Lod;                                               // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfVerticesAtLOD;                             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         MeshVertexColorsPerLODArray;                       // 0x0008(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRVPDPSerializedColorsPerLODInfo       SerializedVertexColorsData;                        // 0x0018(0x0018)(BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        MeshVertexPositionsInComponentSpacePerLODArray;    // 0x0030(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        MeshVertexNormalsPerLODArray;                      // 0x0040(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 MeshVertexIndexes;                                 // 0x0050(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FVertexDetectMeshDataPerLODStruct;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelChannelResults
// 0x0010 (0x0010 - 0x0000)
struct FRVPDPAmountOfColorsOfEachChannelChannelResults
{
public:
	float                                         AmountOfVerticesPaintedAtMinAmount;                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PercentPaintedAtMinAmount;                         // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AverageColorAmountAtMinAmount;                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPAmountOfColorsOfEachChannelChannelResults;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelPhysicsResults
// 0x0004 (0x0014 - 0x0010)
struct FRVPDPAmountOfColorsOfEachChannelPhysicsResults final : public FRVPDPAmountOfColorsOfEachChannelChannelResults
{
public:
	EPhysicalSurface                              PhysicsSurface;                                    // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPAmountOfColorsOfEachChannelPhysicsResults;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAmountOfColorsOfEachChannelResults
// 0x0058 (0x0058 - 0x0000)
struct FRVPDPAmountOfColorsOfEachChannelResults final
{
public:
	bool                                          SuccessfullyGotColorChannelResultsAtMinAmount;     // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults RedChannelResult;                         // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults GreenChannelResult;                       // 0x0014(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults BlueChannelResult;                        // 0x0024(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelChannelResults AlphaChannelResult;                       // 0x0034(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          SuccessfullyGotPhysicsSurfaceResultsAtMinAmount;   // 0x0044(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRVPDPAmountOfColorsOfEachChannelPhysicsResults> PhysicsSurfacesResults;           // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPAmountOfColorsOfEachChannelResults;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPWithinAreaResults
// 0x0068 (0x0068 - 0x0000)
struct FRVPDPWithinAreaResults final
{
public:
	TArray<struct FVertexDetectMeshDataPerLODStruct> MeshVertexDataWithinArea;                       // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPAmountOfColorsOfEachChannelResults AmountOfPaintedColorsOfEachChannelWithinArea;    // 0x0010(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPWithinAreaResults;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPPhysicsSurfaceDataInfo
// 0x0110 (0x0110 - 0x0000)
struct FRVPDPPhysicsSurfaceDataInfo final
{
public:
	bool                                          PhysicsSurfaceSuccessfullyAcquired;                // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPMostDominantPhysicsSurfaceInfo   MostDominantPhysicsSurfaceInfo;                    // 0x0008(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                          MaterialRegisteredToIncludeDefaultChannel;         // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtDefault;                          // 0x0040(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtRed;                              // 0x0060(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtGreen;                            // 0x0080(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtBlue;                             // 0x00A0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataAtChannelInfo  PhysicsSurface_AtAlpha;                            // 0x00C0(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<EPhysicalSurface>                      PhysicalSurfacesAsArray;                           // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<class FString>                         SurfacesAsStringArray;                             // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TArray<float>                                 SurfaceValuesArray;                                // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPPhysicsSurfaceDataInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPEstimatedColorAtHitLocationInfo
// 0x0140 (0x0140 - 0x0000)
struct FRVPDPEstimatedColorAtHitLocationInfo final
{
public:
	bool                                          EstimatedColorAtHitLocationDataSuccessfullyAcquired; // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EstimatedColorAtHitLocation;                       // 0x0004(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPPhysicsSurfaceDataInfo           PhysicalSurfaceInfo;                               // 0x0018(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FVector                                WorldSpaceLocationWeEstimatedTheColorAt;           // 0x0128(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPEstimatedColorAtHitLocationInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexPositionInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPClosestVertexPositionInfo final
{
public:
	struct FVector                                ClosestVertexPositionWorld;                        // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestVertexPositionActorLocal;                   // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPClosestVertexPositionInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexNormalInfo
// 0x0030 (0x0030 - 0x0000)
struct FRVPDPClosestVertexNormalInfo final
{
public:
	struct FVector                                ClosestVertexNormal;                               // 0x0000(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ClosestVertexNormalLocal;                          // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPClosestVertexNormalInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexInfo
// 0x0090 (0x0090 - 0x0000)
struct FRVPDPClosestVertexInfo final
{
public:
	int32                                         ClosestVertexIndex;                                // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ClosestSection;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ClosestVertexColors;                               // 0x0008(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexPositionInfo        ClosestVertexPositionInfo;                         // 0x0018(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexNormalInfo          ClosestVertexNormalInfo;                           // 0x0048(0x0030)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ClosestVertexMaterial;                             // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      ClosestVertexUVAtEachUVChannel;                    // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPClosestVertexInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexDataResults
// 0x01A8 (0x01A8 - 0x0000)
struct FRVPDPClosestVertexDataResults final
{
public:
	bool                                          ClosestVertexDataSuccessfullyAcquired;             // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPClosestVertexInfo                ClosestVertexGeneralInfo;                          // 0x0008(0x0090)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FRVPDPPhysicsSurfaceDataInfo           ClosestVertexPhysicalSurfaceInfo;                  // 0x0098(0x0110)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPClosestVertexDataResults;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPIncludeAmountOfPaintedColorsOfEachChannelSettings
// 0x0018 (0x0018 - 0x0000)
struct FRVPDPIncludeAmountOfPaintedColorsOfEachChannelSettings final
{
public:
	bool                                          IncludeVertexColorChannelResultOfEachChannel;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludePhysicsSurfaceResultOfEachChannel;          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         IncludeIfMinColorAmountIs;                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EPhysicalSurface>                      IncludeOnlyIfPhysicsSurfacesIsRegisteredToAnyVertexChannel; // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPIncludeAmountOfPaintedColorsOfEachChannelSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPCompareMeshVertexColorsSettings
// 0x0024 (0x0024 - 0x0000)
struct FRVPDPCompareMeshVertexColorsSettings
{
public:
	bool                                          SkipEmptyVertices;                                 // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           EmptyVertexColor;                                  // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ComparisonErrorTolerance;                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompareRedChannel;                                 // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompareGreenChannel;                               // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompareBlueChannel;                                // 0x001A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          CompareAlphaChannel;                               // 0x001B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x8];                                       // 0x001C(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPCompareMeshVertexColorsSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPCompareMeshVertexColorsToColorArraySettings
// 0x0014 (0x0038 - 0x0024)
struct FRVPDPCompareMeshVertexColorsToColorArraySettings final : public FRVPDPCompareMeshVertexColorsSettings
{
public:
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FColor>                         ColorArrayToCompareWith;                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPCompareMeshVertexColorsToColorArraySettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPColorSnippetDataAssetInfo
// 0x0018 (0x0018 - 0x0000)
struct FRVPDPColorSnippetDataAssetInfo final
{
public:
	class FString                                 ColorSnippetID;                                    // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVertexPaintColorSnippetDataAsset*      ColorSnippetDataAssetSnippetIsStoredIn;            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPColorSnippetDataAssetInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPCompareMeshVertexColorsToColorSnippetsSettings
// 0x0024 (0x0048 - 0x0024)
struct FRVPDPCompareMeshVertexColorsToColorSnippetsSettings final : public FRVPDPCompareMeshVertexColorsSettings
{
public:
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   CompareWithColorsSnippetTag;                       // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FRVPDPColorSnippetDataAssetInfo> CompareWithColorsSnippetDataAssetInfo;            // 0x0038(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPCompareMeshVertexColorsToColorSnippetsSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPCallbackFromSpecifiedMeshComponentsInfo
// 0x0010 (0x0010 - 0x0000)
struct FRVPDPCallbackFromSpecifiedMeshComponentsInfo final
{
public:
	TArray<class UObject*>                        RunCallbacksOnObjects;                             // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPCallbackFromSpecifiedMeshComponentsInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPTaskCallbackSettings
// 0x00C8 (0x00C8 - 0x0000)
struct FRVPDPTaskCallbackSettings final
{
public:
	bool                                          RunCallbackDelegate;                               // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RunCallbackInterfacesOnObject;                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ObjectToRunInterfacesOn;                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RunCallbackInterfacesOnObjectComponents;           // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexDataOnlyForLOD0;                      // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeColorsOfEachBone;                           // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPIncludeAmountOfPaintedColorsOfEachChannelSettings IncludeAmountOfPaintedColorsOfEachChannel; // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRVPDPCompareMeshVertexColorsToColorArraySettings CompareMeshVertexColorsToColorArray;    // 0x0030(0x0038)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRVPDPCompareMeshVertexColorsToColorSnippetsSettings CompareMeshVertexColorsToColorSnippets; // 0x0068(0x0048)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexColorData;                            // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeSerializedVertexColorData;                  // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexPositionData;                         // 0x00B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexNormalData;                           // 0x00B3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexIndexes;                              // 0x00B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B5[0x3];                                       // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPCallbackFromSpecifiedMeshComponentsInfo CallbacksOnObjectsForMeshComponent;         // 0x00B8(0x0010)(NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPTaskCallbackSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPMultiThreadSettings
// 0x0001 (0x0001 - 0x0000)
struct FRVPDPMultiThreadSettings final
{
public:
	bool                                          UseMultithreadingForCalculations;                  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPMultiThreadSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPGameThreadSpecificDebugSettings
// 0x000C (0x000C - 0x0000)
struct FRVPDPGameThreadSpecificDebugSettings final
{
public:
	bool                                          DrawVertexPositionDebugPoint;                      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawVertexPositionDebugPointIfGotPaintApplied;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawClothVertexPositionDebugPoint;                 // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawVertexNormalDebugArrow;                        // 0x0003(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawPaintConditionsDebugSymbols;                   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawGameThreadSpecificDebugSymbolsDuration;        // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPGameThreadSpecificDebugSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPTaskSpecificDebugSymbolsSettings
// 0x0008 (0x0008 - 0x0000)
struct FRVPDPTaskSpecificDebugSymbolsSettings final
{
public:
	bool                                          DrawTaskDebugSymbols;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DrawTaskDebugSymbolsDuration;                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPTaskSpecificDebugSymbolsSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPDebugSettings
// 0x0028 (0x0028 - 0x0000)
struct FRVPDPDebugSettings final
{
public:
	class UWorld*                                 WorldTaskWasCreatedIn;                             // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PrintLogsToScreen;                                 // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PrintLogsToScreen_Duration;                        // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          PrintLogsToOutputLog;                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPGameThreadSpecificDebugSettings  GameThreadSpecificDebugSymbols;                    // 0x0014(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPTaskSpecificDebugSymbolsSettings TaskSpecificDebugSymbols;                          // 0x0020(0x0008)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPDebugSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPTaskFundamentalSettings
// 0x0110 (0x0110 - 0x0000)
struct FRVPDPTaskFundamentalSettings
{
public:
	class UWorld*                                 TaskWorld;                                         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ComponentItem;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPTaskCallbackSettings             CallbackSettings;                                  // 0x0018(0x00C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRVPDPMultiThreadSettings              MultiThreadSettings;                               // 0x00E0(0x0001)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          IgnoreTaskQueueLimit;                              // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPDebugSettings                    DebugSettings;                                     // 0x00E8(0x0028)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPTaskFundamentalSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPDetectTaskSettings
// 0x0000 (0x0110 - 0x0110)
struct FRVPDPDetectTaskSettings : public FRVPDPTaskFundamentalSettings
{
};
DUMPER7_ASSERTS_FRVPDPDetectTaskSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPGetAverageColorSettings
// 0x000C (0x000C - 0x0000)
struct FRVPDPGetAverageColorSettings final
{
public:
	bool                                          GetAverageColor;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AreaRangeToGetAvarageColorFrom;                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VertexNormalToHitNormal_MinimumDotProductToBeAccountedFor; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPGetAverageColorSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPAtLocationTasksSettings
// 0x0060 (0x0060 - 0x0000)
struct FRVPDPAtLocationTasksSettings final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitLocationInComponentSpace;                       // 0x0018(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                HitNormal;                                         // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   HitBone;                                           // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RunTaskFor;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPAtLocationTasksSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPEstimatedColorAtHitLocationSettings
// 0x000C (0x000C - 0x0000)
struct FRVPDPEstimatedColorAtHitLocationSettings final
{
public:
	bool                                          GetEstimatedColorAtHitLocation;                    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyGetIfMeshHasMaxAmountOfVertices;               // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxAmountOfVertices;                               // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinHitNormalToVertexNormalDotRequired;             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPEstimatedColorAtHitLocationSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPClosestVertexDataOptimizationSettings
// 0x000C (0x000C - 0x0000)
struct FRVPDPClosestVertexDataOptimizationSettings final
{
public:
	int32                                         OptionalStaticMeshFaceIndex;                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AcceptClosestVertexDataIfVertexIsWithinMinRange;   // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AcceptClosestVertexDataIfVertexIsWithinRange;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPClosestVertexDataOptimizationSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPGetClosestVertexDataSettings
// 0x0088 (0x0198 - 0x0110)
struct FRVPDPGetClosestVertexDataSettings final : public FRVPDPDetectTaskSettings
{
public:
	struct FRVPDPGetAverageColorSettings          GetAverageColorInAreaSettings;                     // 0x0110(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPAtLocationTasksSettings          HitFundementals;                                   // 0x0120(0x0060)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FRVPDPEstimatedColorAtHitLocationSettings GetEstimatedColorAtHitLocationSettings;         // 0x0180(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexDataOptimizationSettings ClosestVertexDataOptimizationSettings;        // 0x018C(0x000C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPGetClosestVertexDataSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSkeletalMeshBoneVertexInfo
// 0x0010 (0x0010 - 0x0000)
struct FRVPDPSkeletalMeshBoneVertexInfo final
{
public:
	int32                                         BoneFirstVertex;                                   // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         BoneFirstSectionVertex;                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BoneName;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPSkeletalMeshBoneVertexInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPSkeletalMeshSectionInfo
// 0x0058 (0x0058 - 0x0000)
struct FRVPDPSkeletalMeshSectionInfo final
{
public:
	int32                                         AtSection;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, struct FRVPDPSkeletalMeshBoneVertexInfo> SkeletalMeshBoneVertexInfo;                 // 0x0008(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPSkeletalMeshSectionInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPComponentToCheckIfIsWithinAreaInfo
// 0x02D0 (0x02D0 - 0x0000)
struct alignas(0x10) FRVPDPComponentToCheckIfIsWithinAreaInfo final
{
public:
	class UPrimitiveComponent*                    ComponentToCheckIfIsWithin;                        // 0x0000(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPaintWithinAreaShape                         PaintWithinAreaShape;                              // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          TraceComplexIfComplexShape;                        // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2C6];                                      // 0x000A(0x02C6)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPComponentToCheckIfIsWithinAreaInfo;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPWithinAreaSettings
// 0x0048 (0x0048 - 0x0000)
struct FRVPDPWithinAreaSettings final
{
public:
	TArray<struct FRVPDPComponentToCheckIfIsWithinAreaInfo> ComponentsToCheckIfIsWithin;             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexColorsWithinArea;                     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexPositionsWithinrea;                   // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexNormalsWithinArea;                    // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeVertexIndexesWithinArea;                    // 0x0013(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRVPDPIncludeAmountOfPaintedColorsOfEachChannelSettings IncludeAmountOfColorsOfEachChannelWithinArea; // 0x0018(0x0018)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          TraceForSpecificBonesWithinArea;                   // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x17];                                      // 0x0031(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRVPDPWithinAreaSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPGetColorsWithinAreaSettings
// 0x0048 (0x0158 - 0x0110)
struct FRVPDPGetColorsWithinAreaSettings final : public FRVPDPDetectTaskSettings
{
public:
	struct FRVPDPWithinAreaSettings               WithinAreaSettings;                                // 0x0110(0x0048)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRVPDPGetColorsWithinAreaSettings;

// ScriptStruct VertexPaintDetectionPlugin.RVPDPVertexDataInfo
// 0x0060 (0x0060 - 0x0000)
struct FRVPDPVertexDataInfo final
{
public:
