#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VertexPaintDetectionPlugin

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "VertexPaintDetectionPlugin_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GeometryScriptingCore_structs.hpp"
#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK::Params
{

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetAllVertexColorsOnlyTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentGetAllVertexColorsOnlyTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetClosestVertexDataTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentGetClosestVertexDataTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentGetColorsWithinAreaTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentGetColorsWithinAreaTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintAtLocationTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentPaintAtLocationTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintColorSnippetTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentPaintColorSnippetTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintEntireMeshTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentPaintEntireMeshTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentPaintWithinAreaTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentPaintWithinAreaTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentSetMeshComponentVertexColorsTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks
// 0x0050 (0x0050 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks final
{
public:
	TMap<int32, class UPrimitiveComponent*>       ReturnValue;                                       // 0x0000(0x0050)(ExportObject, Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentSetMeshComponentVertexColorsUsingSerializedStringTasks;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentTasksInitiatedByComponent
// 0x0028 (0x0028 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent final
{
public:
	int32                                         TotalAmountOfTasks;                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetClosestVertexDataTasks;                 // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetAllVertexColorsOnlyTasks;               // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfGetColorsWithinAreaTasks;                  // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintAtLocationTasks;                      // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintWithinAreaTasks;                      // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintEntireMeshTasks;                      // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfPaintColorSnippetTasks;                    // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfSetMeshComponentVertexColorsTasks;         // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AmountOfSetMeshComponentVertexColorsUsingSerializedStringTasks; // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentTasksInitiatedByComponent;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetCurrentTasksMeshComponents
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintDetectionComponent_GetCurrentTasksMeshComponents final
{
public:
	TArray<class UPrimitiveComponent*>            ReturnValue;                                       // 0x0000(0x0010)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetCurrentTasksMeshComponents;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.GetTotalTasksInitiatedByComponent
// 0x0004 (0x0004 - 0x0000)
struct VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_GetTotalTasksInitiatedByComponent;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.HasAnyTasksQueuedUp
// 0x0001 (0x0001 - 0x0000)
struct VertexPaintDetectionComponent_HasAnyTasksQueuedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_HasAnyTasksQueuedUp;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionComponent.TaskRemovedByTaskQueue
// 0x2870 (0x2870 - 0x0000)
struct VertexPaintDetectionComponent_TaskRemovedByTaskQueue final
{
public:
	struct FRVPDPCalculateColorsInfo              CalculateColorsInfo;                               // 0x0000(0x2870)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionComponent_TaskRemovedByTaskQueue;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.AutoPaintDelayFinished
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_AutoPaintDelayFinished final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_AutoPaintDelayFinished;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.AutoPaintedActorDestroyed
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_AutoPaintedActorDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_AutoPaintedActorDestroyed;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.PauseAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_PauseAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_PauseAutoPaintingMesh;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.ResumeAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_ResumeAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_ResumeAutoPaintingMesh;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OnlyStartNewTaskIfChangeWasMade;                   // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorComponent_SetIfAutoPaintedMeshShouldOnlyStartNewTaskIfChangeWasMade;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.StopAutoPaintingMesh
// 0x0008 (0x0008 - 0x0000)
struct AutoAddColorComponent_StopAutoPaintingMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_StopAutoPaintingMesh;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.CanAutoPaintedMeshGetPaused
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_CanAutoPaintedMeshGetPaused final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorComponent_CanAutoPaintedMeshGetPaused;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorComponent_GetIfMeshShouldOnlyStartNewTaskIfChangeWasMade;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetIsAutoPainting
// 0x0001 (0x0001 - 0x0000)
struct AutoAddColorComponent_GetIsAutoPainting final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_GetIsAutoPainting;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.GetMeshesBeingAutoPainted
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorComponent_GetMeshesBeingAutoPainted final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAutoAddColorSettings> ReturnValue;                 // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_GetMeshesBeingAutoPainted;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.IsAutoPaintedMeshPaused
// 0x0010 (0x0010 - 0x0000)
struct AutoAddColorComponent_IsAutoPaintedMeshPaused final
{
public:
	const class UPrimitiveComponent*              MeshComponent;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorComponent_IsAutoPaintedMeshPaused;

// Function VertexPaintDetectionPlugin.AutoAddColorComponent.IsNewRoundOfTasksGoingToStartAfterDelay
// 0x0001 (0x0001 - 0x0000)
struct AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorComponent_IsNewRoundOfTasksGoingToStartAfterDelay;

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.AddAutoPaintEntireMesh
// 0x08B0 (0x08B0 - 0x0000)
struct AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintOnEntireMeshSettings        PaintEntireMeshSettings;                           // 0x0008(0x0458)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0460(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0590(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x08A8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x08A9(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8AA[0x6];                                      // 0x08AA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorEntireMeshComponent_AddAutoPaintEntireMesh;

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.GetAutoPaintingEntireMeshesAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;      // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesAdditionalDataSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.GetAutoPaintingEntireMeshesPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintOnEntireMeshSettings> ReturnValue;            // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorEntireMeshComponent_GetAutoPaintingEntireMeshesPaintSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorEntireMeshComponent.UpdateAutoPaintedEntireMesh
// 0x08A8 (0x08A8 - 0x0000)
struct AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintOnEntireMeshSettings        PaintEntireMeshSettings;                           // 0x0008(0x0458)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0460(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0590(0x0318)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorEntireMeshComponent_UpdateAutoPaintedEntireMesh;

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.AddAutoPaintAtLocation
// 0x09A0 (0x09A0 - 0x0000)
struct AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintAtLocationSettings          PaintAtLocationSettings;                           // 0x0008(0x0548)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0550(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0680(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x0998(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0999(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99A[0x6];                                      // 0x099A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorPaintAtLocComponent_AddAutoPaintAtLocation;

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.GetAutoPaintingAtLocationAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;      // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationAdditionalDataSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.GetAutoPaintingAtLocationPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintAtLocationSettings> ReturnValue;              // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorPaintAtLocComponent_GetAutoPaintingAtLocationPaintSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorPaintAtLocComponent.UpdateAutoPaintedAtLocation
// 0x0998 (0x0998 - 0x0000)
struct AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintAtLocationSettings          PaintAtLocationSettings;                           // 0x0008(0x0548)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0550(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x0680(0x0318)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorPaintAtLocComponent_UpdateAutoPaintedAtLocation;

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.AddAutoPaintWithinArea
// 0x08E8 (0x08E8 - 0x0000)
struct AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintWithinAreaSettings          PaintWithinAreaSettings;                           // 0x0008(0x0490)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0498(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x05C8(0x0318)(Parm, NativeAccessSpecifierPublic)
	bool                                          ResumeIfPaused;                                    // 0x08E0(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x08E1(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8E2[0x6];                                      // 0x08E2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AutoAddColorWithinAreaComponent_AddAutoPaintWithinArea;

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.GetAutoPaintingWithinAreaAdditionalDataSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPAdditionalDataToPassThroughInfo> ReturnValue;      // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaAdditionalDataSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.GetAutoPaintingWithinAreaPaintSettings
// 0x0050 (0x0050 - 0x0000)
struct AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings final
{
public:
	TMap<class UPrimitiveComponent*, struct FRVPDPPaintWithinAreaSettings> ReturnValue;              // 0x0000(0x0050)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorWithinAreaComponent_GetAutoPaintingWithinAreaPaintSettings;

// Function VertexPaintDetectionPlugin.AutoAddColorWithinAreaComponent.UpdateAutoPaintedWithinArea
// 0x08E0 (0x08E0 - 0x0000)
struct AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea final
{
public:
	class UPrimitiveComponent*                    MeshComponent;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRVPDPPaintWithinAreaSettings          PaintWithinAreaSettings;                           // 0x0008(0x0490)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0498(0x0130)(Parm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAutoAddColorSettings             AutoAddColorSettings;                              // 0x05C8(0x0318)(Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AutoAddColorWithinAreaComponent_UpdateAutoPaintedWithinArea;

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.GetClothObjectsToSphereTrace
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace final
{
public:
	TArray<EObjectTypeQuery>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintClothOverlapComponent_GetClothObjectsToSphereTrace;

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.SetClothObjectsTypesToSphereTrace
// 0x0010 (0x0010 - 0x0000)
struct VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace final
{
public:
	TArray<EObjectTypeQuery>                      ClothObjectTypes;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintClothOverlapComponent_SetClothObjectsTypesToSphereTrace;

// Function VertexPaintDetectionPlugin.VertexPaintClothOverlapComponent.SetClothOverlapTracingEnabled
// 0x0001 (0x0001 - 0x0000)
struct VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled final
{
public:
	bool                                          EnableClothTracing;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintClothOverlapComponent_SetClothOverlapTracingEnabled;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.CheckAndGetTheComponentsThatMatchGroupChildSnippets
// 0x0080 (0x0080 - 0x0000)
struct VertexPaintColorSnippetRefs_CheckAndGetTheComponentsThatMatchGroupChildSnippets final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupSnippetID;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UPrimitiveComponent*>            MeshComponents;                                    // 0x0018(0x0010)(Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMap<class FString, class UPrimitiveComponent*> ChildSnippetsAndMatchingMeshes;                  // 0x0028(0x0050)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0078(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_CheckAndGetTheComponentsThatMatchGroupChildSnippets;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.ContainsColorSnippet
// 0x0028 (0x0028 - 0x0000)
struct VertexPaintColorSnippetRefs_ContainsColorSnippet final
{
public:
	class FString                                 SnippetID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OptionalHasToBeStoredInDataAsset;                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UVertexPaintColorSnippetDataAsset*      DataAsset;                                         // 0x0018(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_ContainsColorSnippet;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.GetAllColorSnippetsAndDataAssetForObject
// 0x0058 (0x0058 - 0x0000)
struct VertexPaintColorSnippetRefs_GetAllColorSnippetsAndDataAssetForObject final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRVPDPStoredColorSnippetInfo> ReturnValue;                            // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_GetAllColorSnippetsAndDataAssetForObject;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.GetAllColorSnippetsInSpecifiedDataAsset
// 0x0060 (0x0060 - 0x0000)
struct VertexPaintColorSnippetRefs_GetAllColorSnippetsInSpecifiedDataAsset final
{
public:
	const class UVertexPaintColorSnippetDataAsset* ColorSnippetDataAsset;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeChildGroupSnippets;                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FString, struct FRVPDPStoredColorSnippetInfo> ReturnValue;                            // 0x0010(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_GetAllColorSnippetsInSpecifiedDataAsset;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.GetAllGroupSnippetsInSpecifiedDataAsset
// 0x0058 (0x0058 - 0x0000)
struct VertexPaintColorSnippetRefs_GetAllGroupSnippetsInSpecifiedDataAsset final
{
public:
	const class UVertexPaintColorSnippetDataAsset* ColorSnippetDataAsset;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRVPDPGroupColorSnippetInfo> ReturnValue;                             // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_GetAllGroupSnippetsInSpecifiedDataAsset;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.GetChildSnippetInfosAssociatedWithGroupSnippetID
// 0x0068 (0x0068 - 0x0000)
struct VertexPaintColorSnippetRefs_GetChildSnippetInfosAssociatedWithGroupSnippetID final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GroupSnippetID;                                    // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRVPDPStoredColorSnippetInfo> ReturnValue;                            // 0x0018(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_GetChildSnippetInfosAssociatedWithGroupSnippetID;

// Function VertexPaintDetectionPlugin.VertexPaintColorSnippetRefs.GetObjectFromSnippetID
// 0x0038 (0x0038 - 0x0000)
struct VertexPaintColorSnippetRefs_GetObjectFromSnippetID final
{
public:
	class FString                                 SnippetID;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                 ReturnValue;                                       // 0x0010(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintColorSnippetRefs_GetObjectFromSnippetID;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionGISubSystem.RegisteredDetectTaskCallbackOwnerDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VertexPaintDetectionGISubSystem_RegisteredDetectTaskCallbackOwnerDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionGISubSystem_RegisteredDetectTaskCallbackOwnerDestroyed;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionGISubSystem.RegisteredPaintTaskCallbackOwnerDestroyed
// 0x0008 (0x0008 - 0x0000)
struct VertexPaintDetectionGISubSystem_RegisteredPaintTaskCallbackOwnerDestroyed final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionGISubSystem_RegisteredPaintTaskCallbackOwnerDestroyed;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.ClothBeginOverlappingMesh
// 0x0020 (0x0020 - 0x0000)
struct VertexPaintDetectionInterface_ClothBeginOverlappingMesh final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Item;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_ClothBeginOverlappingMesh;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.ClothEndOverlappingMesh
// 0x0020 (0x0020 - 0x0000)
struct VertexPaintDetectionInterface_ClothEndOverlappingMesh final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Item;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_ClothEndOverlappingMesh;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.ColorsAppliedOnActor
// 0x0440 (0x0440 - 0x0000)
struct VertexPaintDetectionInterface_ColorsAppliedOnActor final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskSettings                PaintedOnActorSettings;                            // 0x01C8(0x0148)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0310(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_ColorsAppliedOnActor;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.DetectTaskFinishedOnRegisteredMeshComponent
// 0x02D0 (0x02D0 - 0x0000)
struct VertexPaintDetectionInterface_DetectTaskFinishedOnRegisteredMeshComponent final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x01A0(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_DetectTaskFinishedOnRegisteredMeshComponent;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.GetAllVertexColorsOnlyOnActor
// 0x03E0 (0x03E0 - 0x0000)
struct VertexPaintDetectionInterface_GetAllVertexColorsOnlyOnActor final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPGetColorsOnlySettings            GotAllVertexColorsWithSettings;                    // 0x01A0(0x0110)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x02B0(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_GetAllVertexColorsOnlyOnActor;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.GetClosestVertexDataOnActor
// 0x0878 (0x0878 - 0x0000)
struct VertexPaintDetectionInterface_GetClosestVertexDataOnActor final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPGetClosestVertexDataSettings     GetClosestVertexDataSettings;                      // 0x01A0(0x0198)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexDataResults         ClosestVertexColorResult;                          // 0x0338(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPEstimatedColorAtHitLocationInfo  EstimatedColorAtHitLocationResult;                 // 0x04E0(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAverageColorInAreaInfo           AverageColorInAreaInfo;                            // 0x0620(0x0128)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0748(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_GetClosestVertexDataOnActor;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.GetColorsWithinArea
// 0x0490 (0x0490 - 0x0000)
struct VertexPaintDetectionInterface_GetColorsWithinArea final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPGetColorsWithinAreaSettings      GetColorsWithinAreaSettings;                       // 0x01A0(0x0158)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPWithinAreaResults                WithinAreaResults;                                 // 0x02F8(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0360(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_GetColorsWithinArea;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.GetSkeletalMeshClothPhysicsSettings
// 0x0058 (0x0058 - 0x0000)
struct VertexPaintDetectionInterface_GetSkeletalMeshClothPhysicsSettings final
{
public:
	class USkeletalMeshComponent*                 SkeletalMeshComponentTryingToGetClothSettingsFor;  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class UClothingAssetBase*, struct FRVPDPVertexChannelsChaosClothPhysicsSettings> ReturnValue; // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_GetSkeletalMeshClothPhysicsSettings;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.OverrideVertexColorToApply
// 0x0080 (0x0080 - 0x0000)
struct VertexPaintDetectionInterface_OverrideVertexColorToApply final
{
public:
	int32                                         OverrideID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVertexPaintDetectionComponent*         AssociatedPaintComponent;                          // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    MeshApplyingColorsTo;                              // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentLOD;                                        // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CurrentVertexIndex;                                // 0x001C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     MaterialVertexIsOn;                                // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsVertexOnCloth;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   BoneVertexIsOn;                                    // 0x002C(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                VertexPositionInWorldSpace;                        // 0x0038(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VertexNormal;                                      // 0x0050(0x0018)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 CurrentVertexColor;                                // 0x0068(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPhysicalSurface                              CurrentVertexMostDominantPhysicsSurface;           // 0x006C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurrentVertexMostDominantPhysicsSurfaceValue;      // 0x0070(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 UpdatedVertexColorToApply;                         // 0x0074(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          WantsToApplyUpdatedVertexColor;                    // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ApplyUpdatedOrOverridenVertexColors;               // 0x0079(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideVertexColorsToApply;                       // 0x007A(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7B[0x1];                                       // 0x007B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FColor                                 VertexColorsToOverrideWith;                        // 0x007C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_OverrideVertexColorToApply;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_AtLocation
// 0x0C50 (0x0C50 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_AtLocation final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPPaintAtLocationSettings          PaintedAtLocationSettings;                         // 0x01C8(0x0548)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPClosestVertexDataResults         ClosestVertexColorResult;                          // 0x0710(0x01A8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPEstimatedColorAtHitLocationInfo  EstimatedColorAtHitLocationResult;                 // 0x08B8(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAverageColorInAreaInfo           AverageColorInAreaInfo;                            // 0x09F8(0x0128)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0B20(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_AtLocation;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_EntireMesh
// 0x0750 (0x0750 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_EntireMesh final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPPaintOnEntireMeshSettings        PaintedEntireMeshSettings;                         // 0x01C8(0x0458)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0620(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_EntireMesh;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_PaintColorSnippet
// 0x04A8 (0x04A8 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_PaintColorSnippet final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPPaintColorSnippetSettings        PaintedColorSnippetSettings;                       // 0x01C8(0x01B0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0378(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_PaintColorSnippet;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_SetMeshComponentVertexColors
// 0x0480 (0x0480 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_SetMeshComponentVertexColors final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPSetVertexColorsSettings          SetMeshComponentVertexColorSettings;               // 0x01C8(0x0188)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0350(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_SetMeshComponentVertexColors;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_SetMeshComponentVertexColorsUsingSerializedString
// 0x0480 (0x0480 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_SetMeshComponentVertexColorsUsingSerializedString final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPSetVertexColorsUsingSerializedStringSettings SetMeshComponentVertexColorUsingSerializedStringSettings; // 0x01C8(0x0188)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x0350(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_SetMeshComponentVertexColorsUsingSerializedString;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintedOnActor_WithinArea
// 0x07F0 (0x07F0 - 0x0000)
struct VertexPaintDetectionInterface_PaintedOnActor_WithinArea final
{
public:
	struct FRVPDPTaskResults                      TaskResultInfo;                                    // 0x0000(0x01A0)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPPaintTaskResultInfo              PaintTaskResultInfo;                               // 0x01A0(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPPaintWithinAreaSettings          PaintedWithinAreaSettings;                         // 0x01C8(0x0490)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FRVPDPWithinAreaResults                WithinAreaResults;                                 // 0x0658(0x0068)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FRVPDPAdditionalDataToPassThroughInfo  AdditionalData;                                    // 0x06C0(0x0130)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VertexPaintDetectionInterface_PaintedOnActor_WithinArea;

// Function VertexPaintDetectionPlugin.VertexPaintDetectionInterface.PaintTaskFinishedOnRegisteredMeshComponent
// 0x02F8 (0x02F8 - 0x0000)
struct VertexPaintDetectionInterface_PaintTaskFinishedOnRegisteredMeshComponent final
{
public:
