#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Module_Casted_Head_Mace_C

#include "Basic.hpp"

#include "Weapon_Module_Casted_Head_Mace_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Module_Casted_Head_Mace_C.Weapon_Module_Casted_Head_Mace_C_C
// 0x0030 (0x0458 - 0x0428)
class AWeapon_Module_Casted_Head_Mace_C_C final : public AWeapon_Module_Casted_Head_Mace_Master_C
{
public:
	class USceneComponent*                        Tip6;                                              // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip5;                                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip4;                                              // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip3;                                              // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip2;                                              // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Tip1;                                              // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_Module_Casted_Head_Mace_C_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Module_Casted_Head_Mace_C_C")
	}
	static class AWeapon_Module_Casted_Head_Mace_C_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Module_Casted_Head_Mace_C_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_Module_Casted_Head_Mace_C_C;

}

