#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Sword_Grip_Master

#include "Basic.hpp"

#include "Modular_Weapon_Grip_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Sword_Grip_Master.Weapon_Sword_Grip_Master_C
// 0x0078 (0x0670 - 0x05F8)
class AWeapon_Sword_Grip_Master_C : public AModular_Weapon_Grip_C
{
public:
	TArray<class UStaticMesh*>                    Random_Mesh;                                       // 0x05F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Start_Mass;                                        // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blade_Length__Unscaled_;                           // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         Blades_1;                                          // 0x0618(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Blades_2;                                          // 0x0628(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UClass*>                         Blades_3;                                          // 0x0638(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Blade_Length_Notch_1;                              // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blade_Length_Notch_2;                              // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blade_Length_Notch_3;                              // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blade_Length_Min;                                  // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Blade_Length_Max;                                  // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_Sword_Grip_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Sword_Grip_Master_C")
	}
	static class AWeapon_Sword_Grip_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_Sword_Grip_Master_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_Sword_Grip_Master_C;

}

