#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZibraVDBRuntime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ZibraVDBRuntime.ZibraVDBAssetComponent.SetZibraVDBMaterialComponent
// 0x0008 (0x0008 - 0x0000)
struct ZibraVDBAssetComponent_SetZibraVDBMaterialComponent final
{
public:
	class UZibraVDBMaterialComponent*             InZibraVDBMaterialComponent;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBAssetComponent_SetZibraVDBMaterialComponent;

// Function ZibraVDBRuntime.ZibraVDBAssetComponent.SetZibraVDBPlaybackComponent
// 0x0008 (0x0008 - 0x0000)
struct ZibraVDBAssetComponent_SetZibraVDBPlaybackComponent final
{
public:
	class UZibraVDBPlaybackComponent*             InZibraVDBPlaybackComponent;                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBAssetComponent_SetZibraVDBPlaybackComponent;

// Function ZibraVDBRuntime.ZibraVDBAssetComponent.SetZibraVDBVolume
// 0x0008 (0x0008 - 0x0000)
struct ZibraVDBAssetComponent_SetZibraVDBVolume final
{
public:
	class UZibraVDBVolume4*                       InZibraVDBVolume;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBAssetComponent_SetZibraVDBVolume;

// Function ZibraVDBRuntime.ZibraVDBAssetComponent.GetZibraVDBVolume
// 0x0008 (0x0008 - 0x0000)
struct ZibraVDBAssetComponent_GetZibraVDBVolume final
{
public:
	const class UZibraVDBVolume4*                 ReturnValue;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBAssetComponent_GetZibraVDBVolume;

// Function ZibraVDBRuntime.ZibraVDBAssetComponent.HasZibraVDBVolume
// 0x0001 (0x0001 - 0x0000)
struct ZibraVDBAssetComponent_HasZibraVDBVolume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBAssetComponent_HasZibraVDBVolume;

// Function ZibraVDBRuntime.ZibraVDBMaterialComponent.SetAbsorptionColor
// 0x0010 (0x0010 - 0x0000)
struct ZibraVDBMaterialComponent_SetAbsorptionColor final
{
public:
	struct FLinearColor                           NewAbsorptionColor;                                // 0x0000(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBMaterialComponent_SetAbsorptionColor;

// Function ZibraVDBRuntime.ZibraVDBMaterialComponent.SetDensityScale
// 0x0004 (0x0004 - 0x0000)
struct ZibraVDBMaterialComponent_SetDensityScale final
{
public:
	float                                         NewDensityScale;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBMaterialComponent_SetDensityScale;

// Function ZibraVDBRuntime.ZibraVDBMaterialComponent.SetZibraVDBAssetComponent
// 0x0008 (0x0008 - 0x0000)
struct ZibraVDBMaterialComponent_SetZibraVDBAssetComponent final
{
public:
	class UZibraVDBAssetComponent*                InZibraVDBAssetComponent;                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBMaterialComponent_SetZibraVDBAssetComponent;

// Function ZibraVDBRuntime.ZibraVDBVolume4.GetChannelNamesUI
// 0x0010 (0x0010 - 0x0000)
struct ZibraVDBVolume4_GetChannelNamesUI final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZibraVDBVolume4_GetChannelNamesUI;

}

